*** crates/worktree/src/application/commands/create_worktree.rs:322:12: delete ! in CreateWorktreeCommand::execute

*** mutation diff:
--- crates/worktree/src/application/commands/create_worktree.rs
+++ delete ! in CreateWorktreeCommand::execute
@@ -314,17 +314,17 @@
     /// Execute the command to create a worktree.
     pub fn execute(
         self,
     ) -> Result<crate::domain::entities::worktree_id::WorktreeId, CreateWorktreeError> {
         // Validate worktree name
         let name = crate::domain::entities::worktree_name::WorktreeName::parse(&self.name)?;
 
         // Validate path is absolute
-        if !self.path.starts_with('/') {
+        if  /* ~ changed by cargo-mutants ~ */self.path.starts_with('/') {
             return Err(CreateWorktreeError::PathNotAbsolute {
                 path: self.path.clone(),
             });
         }
 
         // Validate branch name
         let source_branch =
             crate::domain::entities::worktree::BranchName::parse(&self.source_branch)?;

---- application::commands::create_worktree::tests::test_execute_duplicate_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_duplicate_name' (2922762) panicked at crates/worktree/src/application/commands/create_worktree.rs:178:38:
called `Result::unwrap()` on an `Err` value: PathNotAbsolute { path: "/tmp/test-worktree" }

---- application::commands::create_worktree::tests::test_execute_relative_path stdout ----

thread 'application::commands::create_worktree::tests::test_execute_relative_path' (2922765) panicked at crates/worktree/src/application/commands/create_worktree.rs:241:9:
assertion failed: matches!(result, Err(CreateWorktreeError::PathNotAbsolute { .. }))

---- application::commands::create_worktree::tests::test_execute_git_failure stdout ----

thread 'application::commands::create_worktree::tests::test_execute_git_failure' (2922763) panicked at crates/worktree/src/application/commands/create_worktree.rs:291:9:
assertion failed: matches!(result, Err(CreateWorktreeError::GitError(msg)) if
    msg.contains("git worktree add failed"))

failures:
    application::commands::create_worktree::tests::test_execute_duplicate_name
    application::commands::create_worktree::tests::test_execute_git_failure
    application::commands::create_worktree::tests::test_execute_relative_path
    application::commands::create_worktree::tests::test_execute_repository_not_configured
    application::commands::create_worktree::tests::test_execute_with_git_adapter

test result: FAILED. 106 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
