*** crates/worktree/src/application/commands/create_worktree.rs:37:9: replace <impl GitAdapter for MockGitAdapter>::remove_worktree -> Result<(), GitAdapterError> with Ok(())

*** mutation diff:
--- crates/worktree/src/application/commands/create_worktree.rs
+++ replace <impl GitAdapter for MockGitAdapter>::remove_worktree -> Result<(), GitAdapterError> with Ok(())
@@ -29,17 +29,17 @@
 }
 
 impl GitAdapter for MockGitAdapter {
     fn add_worktree(&self, _path: &str, _source_branch: &str) -> Result<String, GitAdapterError> {
         self.add_worktree_result.clone()
     }
 
     fn remove_worktree(&self, _path: &str) -> Result<(), GitAdapterError> {
-        self.remove_worktree_result.clone()
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Command to create a new worktree.
 ///
 /// This command encapsulates all the logic required to create a worktree,
 /// including validation, persistence, and Git operations.
 #[derive(Debug)]

---- application::commands::delete_worktree::tests::test_execute_with_git_failure stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_with_git_failure' (2944799) panicked at crates/worktree/src/application/commands/delete_worktree.rs:231:9:
assertion failed: result.is_err()

failures:
    application::commands::delete_worktree::tests::test_execute_with_git_failure

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
