*** crates/worktree/src/application/commands/delete_worktree.rs:82:33: replace && with || in DeleteWorktreeCommand::execute

*** mutation diff:
--- crates/worktree/src/application/commands/delete_worktree.rs
+++ replace && with || in DeleteWorktreeCommand::execute
@@ -74,17 +74,17 @@
         let worktree =
             self.repository
                 .get_by_id(&self.id)?
                 .ok_or_else(|| DeleteWorktreeError::NotFound {
                     id: self.id.to_string(),
                 })?;
 
         // Check if worktree is active
-        if worktree.is_active() && !self.force {
+        if worktree.is_active() || /* ~ changed by cargo-mutants ~ */ !self.force {
             return Err(DeleteWorktreeError::WorktreeActive);
         }
 
         // Execute Git operations if adapter is available
         if let Some(ref git_adapter) = self.git_adapter {
             let git_result = git_adapter
                 .remove_worktree(worktree.path_str())
                 .map_err(|e| DeleteWorktreeError::GitError(e.to_string()));

---- application::commands::delete_worktree::tests::test_execute_with_git_failure stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_with_git_failure' (2938471) panicked at crates/worktree/src/application/commands/delete_worktree.rs:236:18:
Expected GitError

---- application::commands::delete_worktree::tests::test_execute_active_worktree_force stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree_force' (2938467) panicked at crates/worktree/src/application/commands/delete_worktree.rs:209:9:
assertion failed: matches!(result, Ok(_))

---- application::commands::delete_worktree::tests::test_execute_repository_not_configured stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_repository_not_configured' (2938469) panicked at crates/worktree/src/application/commands/delete_worktree.rs:277:9:
assertion failed: matches!(result, Ok(_))

failures:
    application::commands::delete_worktree::tests::test_execute_active_worktree_force
    application::commands::delete_worktree::tests::test_execute_repository_not_configured
    application::commands::delete_worktree::tests::test_execute_valid_deletion
    application::commands::delete_worktree::tests::test_execute_with_git_failure

test result: FAILED. 107 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
