*** crates/worktree/src/application/commands/delete_worktree.rs:82:36: delete ! in DeleteWorktreeCommand::execute

*** mutation diff:
--- crates/worktree/src/application/commands/delete_worktree.rs
+++ delete ! in DeleteWorktreeCommand::execute
@@ -74,17 +74,17 @@
         let worktree =
             self.repository
                 .get_by_id(&self.id)?
                 .ok_or_else(|| DeleteWorktreeError::NotFound {
                     id: self.id.to_string(),
                 })?;
 
         // Check if worktree is active
-        if worktree.is_active() && !self.force {
+        if worktree.is_active() &&  /* ~ changed by cargo-mutants ~ */self.force {
             return Err(DeleteWorktreeError::WorktreeActive);
         }
 
         // Execute Git operations if adapter is available
         if let Some(ref git_adapter) = self.git_adapter {
             let git_result = git_adapter
                 .remove_worktree(worktree.path_str())
                 .map_err(|e| DeleteWorktreeError::GitError(e.to_string()));

---- application::commands::delete_worktree::tests::test_execute_active_worktree_force stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree_force' (2940425) panicked at crates/worktree/src/application/commands/delete_worktree.rs:209:9:
assertion failed: matches!(result, Ok(_))

---- application::commands::delete_worktree::tests::test_execute_active_worktree stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree' (2940424) panicked at crates/worktree/src/application/commands/delete_worktree.rs:186:9:
assertion failed: result.is_err()

failures:
    application::commands::delete_worktree::tests::test_execute_active_worktree
    application::commands::delete_worktree::tests::test_execute_active_worktree_force

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
