*** crates/worktree/src/application/commands/delete_worktree.rs:93:16: delete ! in DeleteWorktreeCommand::execute

*** mutation diff:
--- crates/worktree/src/application/commands/delete_worktree.rs
+++ delete ! in DeleteWorktreeCommand::execute
@@ -85,17 +85,17 @@
 
         // Execute Git operations if adapter is available
         if let Some(ref git_adapter) = self.git_adapter {
             let git_result = git_adapter
                 .remove_worktree(worktree.path_str())
                 .map_err(|e| DeleteWorktreeError::GitError(e.to_string()));
 
             // If not force mode, Git failure should propagate
-            if !self.force && git_result.is_err() {
+            if  /* ~ changed by cargo-mutants ~ */self.force && git_result.is_err() {
                 return git_result;
             }
         }
 
         // Delete from repository
         self.repository.delete(&self.id)?;
 
         Ok(())

---- application::commands::delete_worktree::tests::test_execute_with_git_failure_force stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_with_git_failure_force' (2941893) panicked at crates/worktree/src/application/commands/delete_worktree.rs:259:9:
assertion failed: matches!(result, Ok(_))

---- application::commands::delete_worktree::tests::test_execute_with_git_failure stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_with_git_failure' (2941892) panicked at crates/worktree/src/application/commands/delete_worktree.rs:231:9:
assertion failed: result.is_err()

failures:
    application::commands::delete_worktree::tests::test_execute_with_git_failure
    application::commands::delete_worktree::tests::test_execute_with_git_failure_force

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
