*** crates/worktree/src/domain/entities/worktree.rs:234:50: delete field state from struct Self expression in Worktree::activate

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ delete field state from struct Self expression in Worktree::activate
@@ -226,17 +226,17 @@
             description,
         }
     }
 
     /// Activate this worktree.
     ///
     /// Returns a new Worktree with the updated state.
     pub fn activate(self) -> Option<Self> {
-        self.state.activate().map(|state| Self { state, ..self })
+        self.state.activate().map(|state| Self {  /* ~ changed by cargo-mutants ~ */ ..self })
     }
 
     /// Deactivate this worktree.
     ///
     /// Returns a new Worktree with the updated state.
     pub fn deactivate(self) -> Option<Self> {
         self.state.deactivate().map(|state| Self { state, ..self })
     }

---- domain::entities::worktree::tests::test_activate_already_active stdout ----

thread 'domain::entities::worktree::tests::test_activate_already_active' (2954635) panicked at crates/worktree/src/domain/entities/worktree.rs:492:9:
assertion failed: result.is_none()

---- domain::entities::worktree::tests::test_activate_worktree stdout ----

thread 'domain::entities::worktree::tests::test_activate_worktree' (2954636) panicked at crates/worktree/src/domain/entities/worktree.rs:482:9:
assertion `left == right` failed
  left: Created
 right: Active

failures:
    domain::entities::worktree::tests::test_activate_already_active
    domain::entities::worktree::tests::test_activate_worktree

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
