*** crates/worktree/src/domain/entities/worktree.rs:241:9: replace Worktree::deactivate -> Option<Self> with None

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace Worktree::deactivate -> Option<Self> with None
@@ -233,17 +233,17 @@
     pub fn activate(self) -> Option<Self> {
         self.state.activate().map(|state| Self { state, ..self })
     }
 
     /// Deactivate this worktree.
     ///
     /// Returns a new Worktree with the updated state.
     pub fn deactivate(self) -> Option<Self> {
-        self.state.deactivate().map(|state| Self { state, ..self })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the state of this worktree.
     ///
     /// Returns a new Worktree with the updated state.
     pub fn with_state(self, state: WorktreeState) -> Self {
         Self { state, ..self }
     }

---- domain::entities::worktree::tests::test_deactivate_already_inactive stdout ----

thread 'domain::entities::worktree::tests::test_deactivate_already_inactive' (2955211) panicked at crates/worktree/src/domain/entities/worktree.rs:509:62:
called `Option::unwrap()` on a `None` value

---- domain::entities::worktree::tests::test_deactivate_worktree stdout ----

thread 'domain::entities::worktree::tests::test_deactivate_worktree' (2955212) panicked at crates/worktree/src/domain/entities/worktree.rs:500:9:
assertion failed: deactivated.is_some()

failures:
    domain::entities::worktree::tests::test_deactivate_already_inactive
    domain::entities::worktree::tests::test_deactivate_worktree

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
