*** crates/worktree/src/domain/entities/worktree.rs:276:9: replace Worktree::path_str -> &str with "xyzzy"

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace Worktree::path_str -> &str with "xyzzy"
@@ -268,17 +268,17 @@
 
     /// Get the worktree name as a string slice.
     pub fn name_str(&self) -> &str {
         self.name.as_str()
     }
 
     /// Get the path as a string slice.
     pub fn path_str(&self) -> &str {
-        self.path.as_str()
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the source branch as a string slice.
     pub fn source_branch_str(&self) -> &str {
         self.source_branch.as_str()
     }
 }

---- domain::entities::worktree::tests::test_new_worktree stdout ----

thread 'domain::entities::worktree::tests::test_new_worktree' (2961967) panicked at crates/worktree/src/domain/entities/worktree.rs:469:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "/tmp/test-worktree"

failures:
    domain::entities::worktree::tests::test_new_worktree

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
