*** crates/worktree/src/domain/entities/worktree_id.rs:45:9: replace WorktreeId::to_string -> String with String::new()

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_id.rs
+++ replace WorktreeId::to_string -> String with String::new()
@@ -37,17 +37,17 @@
 
     /// Get the inner UUID.
     pub fn as_uuid(&self) -> Uuid {
         self.0
     }
 
     /// Convert to a string representation.
     pub fn to_string(&self) -> String {
-        self.0.to_string()
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if this is the default/empty ID (for testing).
     #[cfg(test)]
     pub(crate) fn is_default(&self) -> bool {
         self.0 == Uuid::nil()
     }
 }

---- domain::entities::worktree_id::tests::test_display stdout ----

thread 'domain::entities::worktree_id::tests::test_display' (2964589) panicked at crates/worktree/src/domain/entities/worktree_id.rs:127:9:
assertion `left == right` failed
  left: ""
 right: "550e8400-e29b-41d4-a716-446655440000"

---- domain::entities::worktree_id::tests::test_parse_valid_uuid stdout ----

thread 'domain::entities::worktree_id::tests::test_parse_valid_uuid' (2964592) panicked at crates/worktree/src/domain/entities/worktree_id.rs:115:9:
assertion `left == right` failed
  left: ""
 right: "550e8400-e29b-41d4-a716-446655440000"

failures:
    domain::entities::worktree_id::tests::test_display
    domain::entities::worktree_id::tests::test_parse_valid_uuid

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
