*** crates/worktree/src/domain/entities/worktree_name.rs:33:20: replace < with == in WorktreeName::parse

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_name.rs
+++ replace < with == in WorktreeName::parse
@@ -25,17 +25,17 @@
     const MIN_LENGTH: usize = 1;
 
     /// Parse a string into a WorktreeName, validating the format.
     ///
     /// # Errors
     /// Returns `WorktreeNameParseError` if the name is invalid.
     pub fn parse(s: &str) -> Result<Self, WorktreeNameParseError> {
         // Validate length
-        if s.len() < Self::MIN_LENGTH {
+        if s.len() == /* ~ changed by cargo-mutants ~ */ Self::MIN_LENGTH {
             return Err(WorktreeNameParseError::TooShort);
         }
         if s.len() > Self::MAX_LENGTH {
             return Err(WorktreeNameParseError::TooLong);
         }
 
         // Cannot start or end with hyphen
         if s.starts_with('-') || s.ends_with('-') {

---- domain::entities::worktree_name::tests::name_too_short stdout ----

thread 'domain::entities::worktree_name::tests::name_too_short' (2968220) panicked at crates/worktree/src/domain/entities/worktree_name.rs:137:9:
assertion `left == right` failed
  left: Ok(WorktreeName(""))
 right: Err(TooShort)

failures:
    domain::entities::worktree_name::tests::name_too_short

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
