*** crates/worktree/src/domain/entities/worktree_name.rs:33:20: replace < with <= in WorktreeName::parse

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_name.rs
+++ replace < with <= in WorktreeName::parse
@@ -25,17 +25,17 @@
     const MIN_LENGTH: usize = 1;
 
     /// Parse a string into a WorktreeName, validating the format.
     ///
     /// # Errors
     /// Returns `WorktreeNameParseError` if the name is invalid.
     pub fn parse(s: &str) -> Result<Self, WorktreeNameParseError> {
         // Validate length
-        if s.len() < Self::MIN_LENGTH {
+        if s.len() <= /* ~ changed by cargo-mutants ~ */ Self::MIN_LENGTH {
             return Err(WorktreeNameParseError::TooShort);
         }
         if s.len() > Self::MAX_LENGTH {
             return Err(WorktreeNameParseError::TooLong);
         }
 
         // Cannot start or end with hyphen
         if s.starts_with('-') || s.ends_with('-') {

*** result: Success
