*** crates/worktree/src/domain/entities/worktree_name.rs:36:20: replace > with < in WorktreeName::parse

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_name.rs
+++ replace > with < in WorktreeName::parse
@@ -28,17 +28,17 @@
     ///
     /// # Errors
     /// Returns `WorktreeNameParseError` if the name is invalid.
     pub fn parse(s: &str) -> Result<Self, WorktreeNameParseError> {
         // Validate length
         if s.len() < Self::MIN_LENGTH {
             return Err(WorktreeNameParseError::TooShort);
         }
-        if s.len() > Self::MAX_LENGTH {
+        if s.len() < /* ~ changed by cargo-mutants ~ */ Self::MAX_LENGTH {
             return Err(WorktreeNameParseError::TooLong);
         }
 
         // Cannot start or end with hyphen
         if s.starts_with('-') || s.ends_with('-') {
             return Err(WorktreeNameParseError::InvalidBoundary);
         }

---- application::commands::create_worktree::tests::test_execute_duplicate_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_duplicate_name' (2970057) panicked at crates/worktree/src/application/commands/create_worktree.rs:178:38:
called `Result::unwrap()` on an `Err` value: InvalidName(TooLong)

---- application::commands::create_worktree::tests::test_execute_relative_path stdout ----

thread 'application::commands::create_worktree::tests::test_execute_relative_path' (2970060) panicked at crates/worktree/src/application/commands/create_worktree.rs:241:9:
assertion failed: matches!(result, Err(CreateWorktreeError::PathNotAbsolute { .. }))

---- application::commands::create_worktree::tests::test_execute_git_failure stdout ----

thread 'application::commands::create_worktree::tests::test_execute_git_failure' (2970058) panicked at crates/worktree/src/application/commands/create_worktree.rs:291:9:
assertion failed: matches!(result, Err(CreateWorktreeError::GitError(msg)) if
    msg.contains("git worktree add failed"))

failures:
    application::commands::create_worktree::tests::test_execute_duplicate_name
    application::commands::create_worktree::tests::test_execute_git_failure
    application::commands::create_worktree::tests::test_execute_relative_path
    application::commands::create_worktree::tests::test_execute_repository_not_configured
    application::commands::create_worktree::tests::test_execute_with_git_adapter
    application::commands::delete_worktree::tests::test_execute_active_worktree
    application::commands::delete_worktree::tests::test_execute_active_worktree_force
    application::commands::delete_worktree::tests::test_execute_repository_not_configured
    application::commands::delete_worktree::tests::test_execute_valid_deletion
    application::commands::delete_worktree::tests::test_execute_with_git_failure
    application::commands::delete_worktree::tests::test_execute_with_g

test result: FAILED. 61 passed; 50 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
