*** crates/worktree/src/domain/entities/worktree_name.rs:82:9: replace WorktreeName::is_empty -> bool with true

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_name.rs
+++ replace WorktreeName::is_empty -> bool with true
@@ -74,17 +74,17 @@
 
     /// Get the length of the name.
     pub fn len(&self) -> usize {
         self.0.len()
     }
 
     /// Check if the name is empty.
     pub fn is_empty(&self) -> bool {
-        self.0.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for WorktreeName {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{}", self.0)
     }
 }

*** result: Success
