*** crates/worktree/src/domain/entities/worktree_state.rs:105:9: replace <impl From<WorktreeState> for &'static str>::from -> Self with Default::default()

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_state.rs
+++ replace <impl From<WorktreeState> for &'static str>::from -> Self with Default::default()
@@ -97,17 +97,17 @@
                 &["created", "active", "inactive"],
             )),
         }
     }
 }
 
 impl From<WorktreeState> for &'static str {
     fn from(state: WorktreeState) -> Self {
-        state.as_str()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

*** result: Success
