*** crates/worktree/src/domain/entities/worktree_state.rs:30:9: replace WorktreeState::is_active -> bool with true

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_state.rs
+++ replace WorktreeState::is_active -> bool with true
@@ -22,17 +22,17 @@
     Created,
     Active,
     Inactive,
 }
 
 impl WorktreeState {
     /// Check if the worktree is currently active.
     pub fn is_active(&self) -> bool {
-        matches!(self, Self::Active)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if the worktree has been created (either active or just created).
     pub fn is_created(&self) -> bool {
         matches!(self, Self::Created | Self::Active)
     }
 
     /// Transition to Active state.

---- application::commands::delete_worktree::tests::test_execute_repository_not_configured stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_repository_not_configured' (2979021) panicked at crates/worktree/src/application/commands/delete_worktree.rs:277:9:
assertion failed: matches!(result, Ok(_))

---- application::commands::delete_worktree::tests::test_execute_valid_deletion stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_valid_deletion' (2979024) panicked at crates/worktree/src/application/commands/delete_worktree.rs:152:9:
assertion failed: result.is_ok()

---- application::commands::delete_worktree::tests::test_execute_with_git_failure stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_with_git_failure' (2979026) panicked at crates/worktree/src/application/commands/delete_worktree.rs:236:18:
Expected GitError

failures:
    application::commands::delete_worktree::tests::test_execute_repository_not_configured
    application::commands::delete_worktree::tests::test_execute_valid_deletion
    application::commands::delete_worktree::tests::test_execute_with_git_failure
    domain::entities::worktree::tests::test_activate_already_active
    domain::entities::worktree::tests::test_activate_worktree
    domain::entities::worktree::tests::test_deactivate_already_inactive
    domain::entities::worktree::tests::test_deactivate_worktree
    domain::entities::worktree_state::tests::test_activate_created
    domain::entities::worktree_state::tests::test_activate_inactive
    domain::entities::worktree_state::tests::test_created_is_not_active
    domain::entities::worktree_state::tests::test_inactive_is_not_active

test result: FAILED. 100 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
