*** crates/worktree/src/domain/entities/worktree_state.rs:35:9: replace WorktreeState::is_created -> bool with true

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_state.rs
+++ replace WorktreeState::is_created -> bool with true
@@ -27,17 +27,17 @@
 impl WorktreeState {
     /// Check if the worktree is currently active.
     pub fn is_active(&self) -> bool {
         matches!(self, Self::Active)
     }
 
     /// Check if the worktree has been created (either active or just created).
     pub fn is_created(&self) -> bool {
-        matches!(self, Self::Created | Self::Active)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Transition to Active state.
     ///
     /// Returns None if already active.
     pub fn activate(self) -> Option<Self> {
         if self.is_active() {
             None

---- domain::entities::worktree_state::tests::test_inactive_is_not_created stdout ----

thread 'domain::entities::worktree_state::tests::test_inactive_is_not_created' (2980320) panicked at crates/worktree/src/domain/entities/worktree_state.rs:140:9:
assertion failed: !WorktreeState::Inactive.is_created()

failures:
    domain::entities::worktree_state::tests::test_inactive_is_not_created

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
