*** crates/worktree/src/domain/entities/worktree_state.rs:42:9: replace WorktreeState::activate -> Option<Self> with None

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_state.rs
+++ replace WorktreeState::activate -> Option<Self> with None
@@ -34,21 +34,17 @@
     pub fn is_created(&self) -> bool {
         matches!(self, Self::Created | Self::Active)
     }
 
     /// Transition to Active state.
     ///
     /// Returns None if already active.
     pub fn activate(self) -> Option<Self> {
-        if self.is_active() {
-            None
-        } else {
-            Some(Self::Active)
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Transition to Inactive state.
     ///
     /// Returns None if already inactive.
     pub fn deactivate(self) -> Option<Self> {
         if matches!(self, Self::Inactive) {
             None

---- domain::entities::worktree::tests::test_activate_already_active stdout ----

thread 'domain::entities::worktree::tests::test_activate_already_active' (2980628) panicked at crates/worktree/src/domain/entities/worktree.rs:489:40:
called `Option::unwrap()` on a `None` value

---- domain::entities::worktree::tests::test_activate_worktree stdout ----

thread 'domain::entities::worktree::tests::test_activate_worktree' (2980629) panicked at crates/worktree/src/domain/entities/worktree.rs:480:9:
assertion failed: activated.is_some()

---- domain::entities::worktree::tests::test_deactivate_already_inactive stdout ----

thread 'domain::entities::worktree::tests::test_deactivate_already_inactive' (2980631) panicked at crates/worktree/src/domain/entities/worktree.rs:509:40:
called `Option::unwrap()` on a `None` value

failures:
    domain::entities::worktree::tests::test_activate_already_active
    domain::entities::worktree::tests::test_activate_worktree
    domain::entities::worktree::tests::test_deactivate_already_inactive
    domain::entities::worktree::tests::test_deactivate_worktree
    domain::entities::worktree_state::tests::test_activate_created
    domain::entities::worktree_state::tests::test_activate_inactive

test result: FAILED. 105 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
