*** crates/worktree/src/domain/entities/worktree_state.rs:93:13: delete match arm "active" in <impl serde::Deserialize<'de> for WorktreeState>::deserialize

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_state.rs
+++ delete match arm "active" in <impl serde::Deserialize<'de> for WorktreeState>::deserialize
@@ -85,17 +85,17 @@
 impl<'de> serde::Deserialize<'de> for WorktreeState {
     fn deserialize<D>(deserializer: D) -> Result<Self, D::Error>
     where
         D: serde::Deserializer<'de>,
     {
         let s = String::deserialize(deserializer)?;
         match s.as_str() {
             "created" => Ok(Self::Created),
-            "active" => Ok(Self::Active),
+             /* ~ changed by cargo-mutants ~ */
             "inactive" => Ok(Self::Inactive),
             _ => Err(serde::de::Error::unknown_variant(
                 &s,
                 &["created", "active", "inactive"],
             )),
         }
     }
 }

---- domain::entities::worktree_state::tests::test_deserialize_valid stdout ----

thread 'domain::entities::worktree_state::tests::test_deserialize_valid' (2984898) panicked at crates/worktree/src/domain/entities/worktree_state.rs:205:72:
called `Result::unwrap()` on an `Err` value: Error("unknown variant `active`, expected one of `created`, `active`, `inactive`", line: 0, column: 0)

failures:
    domain::entities::worktree_state::tests::test_deserialize_valid

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
