*** crates/worktree/src/domain/repositories/worktree_repository.rs:293:9: replace InMemoryWorktreeRepository::all_worktrees -> Vec<Worktree> with vec![]

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace InMemoryWorktreeRepository::all_worktrees -> Vec<Worktree> with vec![]
@@ -285,21 +285,17 @@
 
     /// Get a reference to a worktree by ID (for testing).
     pub fn get_worktree(&self, id: &WorktreeId) -> Option<Worktree> {
         self.worktrees.read().ok()?.get(id).cloned()
     }
 
     /// Get all worktrees (for testing).
     pub fn all_worktrees(&self) -> Vec<Worktree> {
-        self.worktrees
-            .read()
-            .ok()
-            .map(|lock| lock.values().cloned().collect())
-            .unwrap_or_else(|| Vec::new())
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl WorktreeRepository for InMemoryWorktreeRepository {
     fn add(&self, worktree: &Worktree) -> Result<WorktreeId, WorktreeRepositoryError> {
         // Check for duplicate name
         let name = worktree.name_str().to_string();
         let worktrees = self

*** result: Success
