*** crates/worktree/src/domain/repositories/worktree_repository.rs:328:9: replace <impl WorktreeRepository for InMemoryWorktreeRepository>::get_by_id -> Result<Option<Worktree>, WorktreeRepositoryError> with Ok(None)

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace <impl WorktreeRepository for InMemoryWorktreeRepository>::get_by_id -> Result<Option<Worktree>, WorktreeRepositoryError> with Ok(None)
@@ -320,21 +320,17 @@
 
         let id = worktree.id.clone();
         worktrees.insert(id.clone(), worktree.clone());
 
         Ok(id)
     }
 
     fn get_by_id(&self, id: &WorktreeId) -> Result<Option<Worktree>, WorktreeRepositoryError> {
-        let worktrees = self
-            .worktrees
-            .read()
-            .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-        Ok(worktrees.get(id).cloned())
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     fn get_by_name(
         &self,
         name: &WorktreeName,
     ) -> Result<Option<Worktree>, WorktreeRepositoryError> {
         let worktrees = self
             .worktrees

---- application::commands::delete_worktree::tests::test_execute_active_worktree stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree' (3007096) panicked at crates/worktree/src/application/commands/delete_worktree.rs:189:18:
Expected WorktreeActive error

---- application::commands::delete_worktree::tests::test_execute_active_worktree_force stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree_force' (3007097) panicked at crates/worktree/src/application/commands/delete_worktree.rs:209:9:
assertion failed: matches!(result, Ok(_))

---- application::commands::delete_worktree::tests::test_execute_repository_not_configured stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_repository_not_configured' (3007099) panicked at crates/worktree/src/application/commands/delete_worktree.rs:277:9:
assertion failed: matches!(result, Ok(_))

failures:
    application::commands::delete_worktree::tests::test_execute_active_worktree
    application::commands::delete_worktree::tests::test_execute_active_worktree_force
    application::commands::delete_worktree::tests::test_execute_repository_not_configured
    application::commands::delete_worktree::tests::test_execute_valid_deletion
    application::commands::delete_worktree::tests::test_execute_with_git_failure
    application::commands::delete_worktree::tests::test_execute_with_git_failure_force
    application::queries::get_worktree::tests::test_execute_found
    domain::repositories::worktree_repository::tests::test_get_by_id
    domain::repositories::worktree_repository::tests::test_update_state

test result: FAILED. 102 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
