*** crates/worktree/src/domain/repositories/worktree_repository.rs:339:9: replace <impl WorktreeRepository for InMemoryWorktreeRepository>::get_by_name -> Result<Option<Worktree>, WorktreeRepositoryError> with Ok(None)

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace <impl WorktreeRepository for InMemoryWorktreeRepository>::get_by_name -> Result<Option<Worktree>, WorktreeRepositoryError> with Ok(None)
@@ -331,25 +331,17 @@
             .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
         Ok(worktrees.get(id).cloned())
     }
 
     fn get_by_name(
         &self,
         name: &WorktreeName,
     ) -> Result<Option<Worktree>, WorktreeRepositoryError> {
-        let worktrees = self
-            .worktrees
-            .read()
-            .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-
-        Ok(worktrees
-            .values()
-            .find(|w| w.name_str() == name.as_str())
-            .cloned())
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     fn list(&self, filter: ListFilter) -> Result<Vec<Worktree>, WorktreeRepositoryError> {
         let worktrees = self
             .worktrees
             .read()
             .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;

---- application::commands::create_worktree::tests::test_execute_duplicate_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_duplicate_name' (3007718) panicked at crates/worktree/src/application/commands/create_worktree.rs:210:20:
Expected WorktreeExists error, got RepositoryError("Worktree with name 'test-worktree' already exists")

---- domain::repositories::worktree_repository::tests::test_get_by_name stdout ----

thread 'domain::repositories::worktree_repository::tests::test_get_by_name' (3007809) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:432:9:
assertion failed: retrieved.is_some()

failures:
    application::commands::create_worktree::tests::test_execute_duplicate_name
    domain::repositories::worktree_repository::tests::test_get_by_name

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
