*** crates/worktree/src/domain/repositories/worktree_repository.rs:360:9: replace <impl WorktreeRepository for InMemoryWorktreeRepository>::delete -> Result<(), WorktreeRepositoryError> with Ok(())

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace <impl WorktreeRepository for InMemoryWorktreeRepository>::delete -> Result<(), WorktreeRepositoryError> with Ok(())
@@ -352,27 +352,17 @@
             .worktrees
             .read()
             .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
 
         Ok(filter.apply(worktrees.values()).cloned().collect())
     }
 
     fn delete(&self, id: &WorktreeId) -> Result<(), WorktreeRepositoryError> {
-        let mut worktrees = self
-            .worktrees
-            .write()
-            .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-
-        if !worktrees.contains_key(id) {
-            return Err(WorktreeRepositoryError::not_found(id.to_string().as_str()));
-        }
-
-        worktrees.remove(id);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn update_state(
         &self,
         id: &WorktreeId,
         state: WorktreeState,
     ) -> Result<(), WorktreeRepositoryError> {
         let mut worktrees = self

---- domain::repositories::worktree_repository::tests::test_delete_nonexistent stdout ----

thread 'domain::repositories::worktree_repository::tests::test_delete_nonexistent' (3009989) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:480:9:
assertion failed: result.is_err()

---- domain::repositories::worktree_repository::tests::test_delete stdout ----

thread 'domain::repositories::worktree_repository::tests::test_delete' (3009988) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:471:9:
assertion failed: retrieved.is_none()

failures:
    domain::repositories::worktree_repository::tests::test_delete
    domain::repositories::worktree_repository::tests::test_delete_nonexistent

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
