*** crates/worktree/src/domain/repositories/worktree_repository.rs:56:9: replace ListFilter::with_name_prefix -> Self with Default::default()

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace ListFilter::with_name_prefix -> Self with Default::default()
@@ -48,18 +48,17 @@
     /// Set the state filter.
     pub fn with_state(mut self, state: WorktreeState) -> Self {
         self.state = Some(state);
         self
     }
 
     /// Set the name prefix filter.
     pub fn with_name_prefix(mut self, prefix: &str) -> Self {
-        self.name_prefix = Some(prefix.to_string());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the limit.
     pub fn with_limit(mut self, limit: usize) -> Self {
         self.limit = Some(limit);
         self
     }

---- application::queries::list_worktrees::tests::test_execute_combined_filters stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_combined_filters' (2994023) panicked at crates/worktree/src/application/queries/list_worktrees.rs:373:9:
assertion `left == right` failed
  left: "feature-2"
 right: "feature-1"

---- application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix' (2994027) panicked at crates/worktree/src/application/queries/list_worktrees.rs:293:9:
assertion `left == right` failed
  left: 3
 right: 2

---- domain::repositories::worktree_repository::tests::test_list_name_prefix stdout ----

thread 'domain::repositories::worktree_repository::tests::test_list_name_prefix' (2994172) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:593:9:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix
    domain::repositories::worktree_repository::tests::test_list_name_prefix

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
