*** crates/worktree/src/domain/repositories/worktree_repository.rs:89:39: replace != with == in ListFilter::matches

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace != with == in ListFilter::matches
@@ -81,17 +81,17 @@
             .filter(move |w| self.matches(w))
             .skip(offset)
             .take(limit)
     }
 
     /// Check if a worktree matches this filter.
     fn matches(&self, worktree: &Worktree) -> bool {
         if let Some(ref worktree_type) = self.worktree_type {
-            if worktree.worktree_type != *worktree_type {
+            if worktree.worktree_type == /* ~ changed by cargo-mutants ~ */ *worktree_type {
                 return false;
             }
         }
 
         if let Some(state) = self.state {
             if worktree.state != state {
                 return false;
             }

---- application::queries::list_worktrees::tests::test_execute_empty_result stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_empty_result' (2996528) panicked at crates/worktree/src/application/queries/list_worktrees.rs:390:9:
assertion `left == right` failed
  left: 1
 right: 0

---- application::queries::list_worktrees::tests::test_execute_combined_filters stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_combined_filters' (2996526) panicked at crates/worktree/src/application/queries/list_worktrees.rs:372:9:
assertion `left == right` failed
  left: 0
 right: 1

---- application::queries::list_worktrees::tests::test_execute_filter_by_type stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_type' (2996535) panicked at crates/worktree/src/application/queries/list_worktrees.rs:234:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_empty_result
    application::queries::list_worktrees::tests::test_execute_filter_by_type

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
