*** crates/worktree/src/domain/repositories/worktree_repository.rs:95:31: replace != with == in ListFilter::matches

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace != with == in ListFilter::matches
@@ -87,17 +87,17 @@
     fn matches(&self, worktree: &Worktree) -> bool {
         if let Some(ref worktree_type) = self.worktree_type {
             if worktree.worktree_type != *worktree_type {
                 return false;
             }
         }
 
         if let Some(state) = self.state {
-            if worktree.state != state {
+            if worktree.state == /* ~ changed by cargo-mutants ~ */ state {
                 return false;
             }
         }
 
         if let Some(ref prefix) = self.name_prefix {
             if !worktree.name_str().starts_with(prefix) {
                 return false;
             }

---- application::queries::list_worktrees::tests::test_execute_combined_filters stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_combined_filters' (2996539) panicked at crates/worktree/src/application/queries/list_worktrees.rs:373:9:
assertion `left == right` failed
  left: "feature-2"
 right: "feature-1"

---- application::queries::list_worktrees::tests::test_execute_filter_by_state stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_state' (2996545) panicked at crates/worktree/src/application/queries/list_worktrees.rs:265:9:
assertion `left == right` failed
  left: 2
 right: 1

---- domain::repositories::worktree_repository::tests::test_list_with_filter stdout ----

thread 'domain::repositories::worktree_repository::tests::test_list_with_filter' (2996787) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:469:9:
assertion `left == right` failed
  left: "test-1"
 right: "test-2"

failures:
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_filter_by_state
    domain::repositories::worktree_repository::tests::test_list_with_filter

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
