*** crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:195:9: replace <impl WorktreeRepository for SqlxWorktreeRepository>::delete -> Result<(), WorktreeRepositoryError> with Ok(())

*** mutation diff:
--- crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs
+++ replace <impl WorktreeRepository for SqlxWorktreeRepository>::delete -> Result<(), WorktreeRepositoryError> with Ok(())
@@ -187,36 +187,17 @@
                     .into_iter()
                     .map(|row| row.to_worktree())
                     .collect::<Result<Vec<_>, _>>()
             })
         })
     }
 
     fn delete(&self, id: &WorktreeId) -> Result<(), WorktreeRepositoryError> {
-        let pool = self.pool.clone();
-        let id_str = id.to_string();
-
-        tokio::task::block_in_place(|| {
-            tokio::runtime::Handle::current().block_on(async move {
-                let sql = r#"DELETE FROM worktrees WHERE id = ?"#;
-
-                let result = sqlx::query(sql)
-                    .bind(id_str.clone())
-                    .execute(pool.as_ref())
-                    .await
-                    .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-
-                if result.rows_affected() == 0 {
-                    Err(WorktreeRepositoryError::not_found(&id_str))
-                } else {
-                    Ok(())
-                }
-            })
-        })
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn update_state(
         &self,
         id: &WorktreeId,
         state: WorktreeState,
     ) -> Result<(), WorktreeRepositoryError> {
         let pool = self.pool.clone();

*** result: Success
