*** crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:222:9: replace <impl WorktreeRepository for SqlxWorktreeRepository>::update_state -> Result<(), WorktreeRepositoryError> with Ok(())

*** mutation diff:
--- crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs
+++ replace <impl WorktreeRepository for SqlxWorktreeRepository>::update_state -> Result<(), WorktreeRepositoryError> with Ok(())
@@ -214,38 +214,17 @@
         })
     }
 
     fn update_state(
         &self,
         id: &WorktreeId,
         state: WorktreeState,
     ) -> Result<(), WorktreeRepositoryError> {
-        let pool = self.pool.clone();
-        let id_str = id.to_string();
-        let state_str = state.to_string();
-
-        tokio::task::block_in_place(|| {
-            tokio::runtime::Handle::current().block_on(async move {
-                let sql = r#"UPDATE worktrees SET state = ? WHERE id = ?"#;
-
-                let result = sqlx::query(sql)
-                    .bind(state_str)
-                    .bind(id_str.clone())
-                    .execute(pool.as_ref())
-                    .await
-                    .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-
-                if result.rows_affected() == 0 {
-                    Err(WorktreeRepositoryError::not_found(&id_str))
-                } else {
-                    Ok(())
-                }
-            })
-        })
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Helper struct for mapping SQL rows to Worktree.
 #[derive(sqlx::FromRow)]
 struct WorktreeRow {
     id: String,
     name: String,

*** result: Success
