*** crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:237:43: replace == with != in <impl WorktreeRepository for SqlxWorktreeRepository>::update_state

*** mutation diff:
--- crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs
+++ replace == with != in <impl WorktreeRepository for SqlxWorktreeRepository>::update_state
@@ -229,17 +229,17 @@
 
                 let result = sqlx::query(sql)
                     .bind(state_str)
                     .bind(id_str.clone())
                     .execute(pool.as_ref())
                     .await
                     .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
 
-                if result.rows_affected() == 0 {
+                if result.rows_affected() != /* ~ changed by cargo-mutants ~ */ 0 {
                     Err(WorktreeRepositoryError::not_found(&id_str))
                 } else {
                     Ok(())
                 }
             })
         })
     }
 }

*** result: Success
