*** crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:334:9: delete match arm "created" in parse_state

*** mutation diff:
--- crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs
+++ delete match arm "created" in parse_state
@@ -326,17 +326,17 @@
         .fetch_all(pool.as_ref())
         .await
         .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))
 }
 
 /// Parse a state string into WorktreeState.
 fn parse_state(s: &str) -> Result<WorktreeState, WorktreeRepositoryError> {
     match s.to_lowercase().as_str() {
-        "created" => Ok(WorktreeState::Created),
+         /* ~ changed by cargo-mutants ~ */
         "active" => Ok(WorktreeState::Active),
         "inactive" => Ok(WorktreeState::Inactive),
         _ => Err(WorktreeRepositoryError::DatabaseError(String::from(
             format!("Invalid state: {}", s),
         ))),
     }
 }

---- infrastructure::persistence::worktree_repository_sqlx::tests::test_parse_state stdout ----

thread 'infrastructure::persistence::worktree_repository_sqlx::tests::test_parse_state' (3017690) panicked at crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:354:43:
called `Result::unwrap()` on an `Err` value: DatabaseError("Invalid state: created")

failures:
    infrastructure::persistence::worktree_repository_sqlx::tests::test_parse_state

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
