*** crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:336:9: delete match arm "inactive" in parse_state

*** mutation diff:
--- crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs
+++ delete match arm "inactive" in parse_state
@@ -328,17 +328,17 @@
         .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))
 }
 
 /// Parse a state string into WorktreeState.
 fn parse_state(s: &str) -> Result<WorktreeState, WorktreeRepositoryError> {
     match s.to_lowercase().as_str() {
         "created" => Ok(WorktreeState::Created),
         "active" => Ok(WorktreeState::Active),
-        "inactive" => Ok(WorktreeState::Inactive),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(WorktreeRepositoryError::DatabaseError(String::from(
             format!("Invalid state: {}", s),
         ))),
     }
 }
 
 /// Parse a worktree type string into WorktreeTypeEnum.
 fn parse_worktree_type(s: &str) -> Result<WorktreeTypeEnum, WorktreeRepositoryError> {

---- infrastructure::persistence::worktree_repository_sqlx::tests::test_parse_state stdout ----

thread 'infrastructure::persistence::worktree_repository_sqlx::tests::test_parse_state' (3019694) panicked at crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:356:44:
called `Result::unwrap()` on an `Err` value: DatabaseError("Invalid state: inactive")

failures:
    infrastructure::persistence::worktree_repository_sqlx::tests::test_parse_state

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
