*** crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:90:9: replace <impl WorktreeRepository for SqlxWorktreeRepository>::add -> Result<WorktreeId, WorktreeRepositoryError> with Ok(Default::default())

*** mutation diff:
--- crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs
+++ replace <impl WorktreeRepository for SqlxWorktreeRepository>::add -> Result<WorktreeId, WorktreeRepositoryError> with Ok(Default::default())
@@ -82,50 +82,17 @@
     /// Get the inner pool for direct queries.
     pub fn pool(&self) -> &Pool<Sqlite> {
         &self.pool
     }
 }
 
 impl WorktreeRepository for SqlxWorktreeRepository {
     fn add(&self, worktree: &Worktree) -> Result<WorktreeId, WorktreeRepositoryError> {
-        let pool = self.pool.clone();
-        let worktree = worktree.clone();
-
-        tokio::task::block_in_place(|| {
-            tokio::runtime::Handle::current().block_on(async move {
-                let sql = r#"
-                    INSERT INTO worktrees (id, name, worktree_type, path, state, source_branch, description, created_at)
-                    VALUES (?, ?, ?, ?, ?, ?, ?, ?)
-                "#;
-
-                let result = sqlx::query(sql)
-                     .bind(worktree.id.to_string())
-                     .bind(worktree.name.to_string())
-                     .bind(worktree.worktree_type.to_string())
-                     .bind(worktree.path.to_string())
-                     .bind(worktree.state.to_string())
-                     .bind(worktree.source_branch.to_string())
-                     .bind(worktree.description.as_deref())
-                     .bind(worktree.created_at.to_rfc3339())
-                     .execute(pool.as_ref())
-                     .await;
-
-                 match result {
-                     Ok(_) => Ok(worktree.id),
-                     Err(e) => {
-                         if e.to_string().contains("UNIQUE constraint failed") {
-                             Err(WorktreeRepositoryError::duplicate_name(worktree.name_str()))
-                         } else {
-                             Err(WorktreeRepositoryError::DatabaseError(e.to_string()))
-                         }
-                     }
-                 }
-            })
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn get_by_id(&self, id: &WorktreeId) -> Result<Option<Worktree>, WorktreeRepositoryError> {
         let pool = self.pool.clone();
         let id_str = id.to_string();
 
         tokio::task::block_in_place(|| {
             tokio::runtime::Handle::current().block_on(async move {

*** result: Success
