*** crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:88:9: replace <impl GitAdapter for GitWorktreeAdapter>::add_worktree -> Result<String, GitAdapterError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs
+++ replace <impl GitAdapter for GitWorktreeAdapter>::add_worktree -> Result<String, GitAdapterError> with Ok("xyzzy".into())
@@ -80,34 +80,17 @@
 
         Ok(String::from_utf8_lossy(&output.stdout).to_string())
     }
 }
 
 impl GitAdapter for GitWorktreeAdapter {
     fn add_worktree(&self, path: &str, source_branch: &str) -> Result<String, GitAdapterError> {
         // Validate path is absolute
-        if !path.starts_with('/') {
-            return Err(GitAdapterError::PathExists {
-                path: path.to_string(),
-            });
-        }
-
-        // Check if path already exists
-        let path_obj = Path::new(path);
-        if path_obj.exists() {
-            return Err(GitAdapterError::PathExists {
-                path: path.to_string(),
-            });
-        }
-
-        // Execute: git worktree add <path> <branch>
-        self.execute_git(&["worktree", "add", path, source_branch])?;
-
-        Ok(path.to_string())
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn remove_worktree(&self, path: &str) -> Result<(), GitAdapterError> {
         // Execute: git worktree remove <path>
         self.execute_git(&["worktree", "remove", path])?;
         Ok(())
     }
 }

---- infrastructure::vcs::git_worktree_adapter::tests::test_add_worktree_relative_path stdout ----

thread 'infrastructure::vcs::git_worktree_adapter::tests::test_add_worktree_relative_path' (3022753) panicked at crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:308:9:
assertion failed: result.is_err()

---- infrastructure::vcs::git_worktree_adapter::tests::test_add_worktree_path_exists stdout ----

thread 'infrastructure::vcs::git_worktree_adapter::tests::test_add_worktree_path_exists' (3022752) panicked at crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:328:9:
assertion failed: result.is_err()

failures:
    infrastructure::vcs::git_worktree_adapter::tests::test_add_worktree_path_exists
    infrastructure::vcs::git_worktree_adapter::tests::test_add_worktree_relative_path

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
