*** crates/worktree/src/application/commands/create_worktree.rs:319:9: replace CreateWorktreeCommand::execute -> Result<crate::domain::entities::worktree_id::WorktreeId, CreateWorktreeError> with Ok(Default::default())

*** mutation diff:
--- crates/worktree/src/application/commands/create_worktree.rs
+++ replace CreateWorktreeCommand::execute -> Result<crate::domain::entities::worktree_id::WorktreeId, CreateWorktreeError> with Ok(Default::default())
@@ -311,60 +311,17 @@
 }
 
 impl CreateWorktreeCommand {
     /// Execute the command to create a worktree.
     pub fn execute(
         self,
     ) -> Result<crate::domain::entities::worktree_id::WorktreeId, CreateWorktreeError> {
         // Validate worktree name
-        let name = crate::domain::entities::worktree_name::WorktreeName::parse(&self.name)?;
-
-        // Validate path is absolute
-        if !self.path.starts_with('/') {
-            return Err(CreateWorktreeError::PathNotAbsolute {
-                path: self.path.clone(),
-            });
-        }
-
-        // Validate branch name
-        let source_branch =
-            crate::domain::entities::worktree::BranchName::parse(&self.source_branch)?;
-
-        // Validate absolute path
-        let path = crate::domain::entities::worktree::AbsolutePath::parse(&self.path)?;
-
-        // Check for duplicate name
-        let check_duplicate = self.repository.get_by_name(&name)?;
-        if check_duplicate.is_some() {
-            return Err(CreateWorktreeError::WorktreeExists {
-                name: self.name.clone(),
-            });
-        }
-
-        // Perform Git operation if adapter is available
-        if let Some(ref adapter) = self.git_adapter {
-            let _ = adapter
-                .add_worktree(&self.path, &self.source_branch)
-                .map_err(|e| CreateWorktreeError::GitError(e.to_string()))?;
-        }
-
-        // Create worktree entity
-        let worktree = crate::domain::entities::worktree::Worktree::new(
-            name.clone(),
-            self.worktree_type.clone(),
-            path.clone(),
-            source_branch.clone(),
-            self.description.clone(),
-        )?;
-
-        // Persist worktree
-        let id = self.repository.add(&worktree)?;
-
-        Ok(id)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Create a command for testing purposes.
     #[cfg(test)]
     pub fn for_testing(
         name: String,
         worktree_type: WorktreeTypeEnum,
         path: String,

---- application::commands::create_worktree::tests::test_execute_git_failure stdout ----

thread 'application::commands::create_worktree::tests::test_execute_git_failure' (2913310) panicked at crates/worktree/src/application/commands/create_worktree.rs:290:9:
assertion failed: result.is_err()

---- application::commands::create_worktree::tests::test_execute_duplicate_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_duplicate_name' (2913309) panicked at crates/worktree/src/application/commands/create_worktree.rs:205:9:
assertion failed: result.is_err()

---- application::commands::create_worktree::tests::test_execute_relative_path stdout ----

thread 'application::commands::create_worktree::tests::test_execute_relative_path' (2913312) panicked at crates/worktree/src/application/commands/create_worktree.rs:240:9:
assertion failed: result.is_err()

failures:
    application::commands::create_worktree::tests::test_execute_duplicate_name
    application::commands::create_worktree::tests::test_execute_git_failure
    application::commands::create_worktree::tests::test_execute_invalid_name
    application::commands::create_worktree::tests::test_execute_relative_path

test result: FAILED. 107 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
