*** crates/worktree/src/application/commands/delete_worktree.rs:74:9: replace DeleteWorktreeCommand::execute -> Result<(), DeleteWorktreeError> with Ok(())

*** mutation diff:
--- crates/worktree/src/application/commands/delete_worktree.rs
+++ replace DeleteWorktreeCommand::execute -> Result<(), DeleteWorktreeError> with Ok(())
@@ -66,44 +66,17 @@
     ///
     /// # Returns
     /// `Ok(())` if successful.
     ///
     /// # Errors
     /// Returns `DeleteWorktreeError` if deletion fails.
     pub fn execute(self) -> Result<(), DeleteWorktreeError> {
         // Check if worktree exists
-        let worktree =
-            self.repository
-                .get_by_id(&self.id)?
-                .ok_or_else(|| DeleteWorktreeError::NotFound {
-                    id: self.id.to_string(),
-                })?;
-
-        // Check if worktree is active
-        if worktree.is_active() && !self.force {
-            return Err(DeleteWorktreeError::WorktreeActive);
-        }
-
-        // Execute Git operations if adapter is available
-        if let Some(ref git_adapter) = self.git_adapter {
-            let git_result = git_adapter
-                .remove_worktree(worktree.path_str())
-                .map_err(|e| DeleteWorktreeError::GitError(e.to_string()));
-
-            // If not force mode, Git failure should propagate
-            if !self.force && git_result.is_err() {
-                return git_result;
-            }
-        }
-
-        // Delete from repository
-        self.repository.delete(&self.id)?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Create a command with in-memory repository (for testing).
     pub fn for_testing(id: WorktreeId) -> Self {
         Self {
             id,
             repository: Box::new(InMemoryWorktreeRepository::new()),
             git_adapter: None,

---- application::commands::delete_worktree::tests::test_execute_active_worktree stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree' (2934587) panicked at crates/worktree/src/application/commands/delete_worktree.rs:159:9:
assertion failed: result.is_err()

---- application::commands::delete_worktree::tests::test_execute_with_git_failure stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_with_git_failure' (2934592) panicked at crates/worktree/src/application/commands/delete_worktree.rs:204:9:
assertion failed: result.is_err()

---- application::commands::delete_worktree::tests::test_execute_not_found stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_not_found' (2934589) panicked at crates/worktree/src/application/commands/delete_worktree.rs:134:9:
assertion failed: result.is_err()

failures:
    application::commands::delete_worktree::tests::test_execute_active_worktree
    application::commands::delete_worktree::tests::test_execute_not_found
    application::commands::delete_worktree::tests::test_execute_with_git_failure

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
