*** crates/worktree/src/domain/entities/worktree.rs:111:9: replace BranchName::len -> usize with 0

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace BranchName::len -> usize with 0
@@ -103,17 +103,17 @@
 
     /// Get the inner string slice.
     pub fn as_str(&self) -> &str {
         &self.0
     }
 
     /// Get the length of the branch name.
     pub fn len(&self) -> usize {
-        self.0.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if empty.
     pub fn is_empty(&self) -> bool {
         self.0.is_empty()
     }
 }

*** result: Success
