*** crates/worktree/src/domain/entities/worktree.rs:116:9: replace BranchName::is_empty -> bool with false

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace BranchName::is_empty -> bool with false
@@ -108,17 +108,17 @@
 
     /// Get the length of the branch name.
     pub fn len(&self) -> usize {
         self.0.len()
     }
 
     /// Check if empty.
     pub fn is_empty(&self) -> bool {
-        self.0.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::fmt::Display for BranchName {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         write!(f, "{}", self.0)
     }
 }

*** result: Success
