*** crates/worktree/src/domain/entities/worktree.rs:234:9: replace Worktree::activate -> Option<Self> with None

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace Worktree::activate -> Option<Self> with None
@@ -226,17 +226,17 @@
             description,
         }
     }
 
     /// Activate this worktree.
     ///
     /// Returns a new Worktree with the updated state.
     pub fn activate(self) -> Option<Self> {
-        self.state.activate().map(|state| Self { state, ..self })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Deactivate this worktree.
     ///
     /// Returns a new Worktree with the updated state.
     pub fn deactivate(self) -> Option<Self> {
         self.state.deactivate().map(|state| Self { state, ..self })
     }

---- domain::entities::worktree::tests::test_activate_already_active stdout ----

thread 'domain::entities::worktree::tests::test_activate_already_active' (2953808) panicked at crates/worktree/src/domain/entities/worktree.rs:489:40:
called `Option::unwrap()` on a `None` value

---- domain::entities::worktree::tests::test_activate_worktree stdout ----

thread 'domain::entities::worktree::tests::test_activate_worktree' (2953809) panicked at crates/worktree/src/domain/entities/worktree.rs:480:9:
assertion failed: activated.is_some()

---- domain::entities::worktree::tests::test_deactivate_already_inactive stdout ----

thread 'domain::entities::worktree::tests::test_deactivate_already_inactive' (2953811) panicked at crates/worktree/src/domain/entities/worktree.rs:509:40:
called `Option::unwrap()` on a `None` value

failures:
    domain::entities::worktree::tests::test_activate_already_active
    domain::entities::worktree::tests::test_activate_worktree
    domain::entities::worktree::tests::test_deactivate_already_inactive
    domain::entities::worktree::tests::test_deactivate_worktree

test result: FAILED. 107 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
