*** crates/worktree/src/domain/entities/worktree.rs:241:52: delete field state from struct Self expression in Worktree::deactivate

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ delete field state from struct Self expression in Worktree::deactivate
@@ -233,17 +233,17 @@
     pub fn activate(self) -> Option<Self> {
         self.state.activate().map(|state| Self { state, ..self })
     }
 
     /// Deactivate this worktree.
     ///
     /// Returns a new Worktree with the updated state.
     pub fn deactivate(self) -> Option<Self> {
-        self.state.deactivate().map(|state| Self { state, ..self })
+        self.state.deactivate().map(|state| Self {  /* ~ changed by cargo-mutants ~ */ ..self })
     }
 
     /// Set the state of this worktree.
     ///
     /// Returns a new Worktree with the updated state.
     pub fn with_state(self, state: WorktreeState) -> Self {
         Self { state, ..self }
     }

---- domain::entities::worktree::tests::test_deactivate_already_inactive stdout ----

thread 'domain::entities::worktree::tests::test_deactivate_already_inactive' (2955714) panicked at crates/worktree/src/domain/entities/worktree.rs:512:9:
assertion failed: result.is_none()

---- domain::entities::worktree::tests::test_deactivate_worktree stdout ----

thread 'domain::entities::worktree::tests::test_deactivate_worktree' (2955715) panicked at crates/worktree/src/domain/entities/worktree.rs:502:9:
assertion `left == right` failed
  left: Active
 right: Inactive

failures:
    domain::entities::worktree::tests::test_deactivate_already_inactive
    domain::entities::worktree::tests::test_deactivate_worktree

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
