*** crates/worktree/src/domain/entities/worktree.rs:248:16: delete field state from struct Self expression in Worktree::with_state

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ delete field state from struct Self expression in Worktree::with_state
@@ -240,17 +240,17 @@
     pub fn deactivate(self) -> Option<Self> {
         self.state.deactivate().map(|state| Self { state, ..self })
     }
 
     /// Set the state of this worktree.
     ///
     /// Returns a new Worktree with the updated state.
     pub fn with_state(self, state: WorktreeState) -> Self {
-        Self { state, ..self }
+        Self {  /* ~ changed by cargo-mutants ~ */ ..self }
     }
 
     /// Update the description.
     pub fn with_description(self, description: Option<String>) -> Self {
         Self {
             description,
             ..self
         }

---- application::queries::list_worktrees::tests::test_execute_combined_filters stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_combined_filters' (2956741) panicked at crates/worktree/src/application/queries/list_worktrees.rs:373:9:
assertion `left == right` failed
  left: "feature-2"
 right: "feature-1"

---- application::queries::list_worktrees::tests::test_execute_filter_by_state stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_state' (2956744) panicked at crates/worktree/src/application/queries/list_worktrees.rs:265:9:
assertion `left == right` failed
  left: 0
 right: 1

---- domain::repositories::worktree_repository::tests::test_list_with_filter stdout ----

thread 'domain::repositories::worktree_repository::tests::test_list_with_filter' (2956820) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:468:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_filter_by_state
    domain::repositories::worktree_repository::tests::test_list_with_filter

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
