*** crates/worktree/src/domain/entities/worktree.rs:261:9: replace Worktree::is_active -> bool with true

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace Worktree::is_active -> bool with true
@@ -253,17 +253,17 @@
         Self {
             description,
             ..self
         }
     }
 
     /// Check if this worktree is active.
     pub fn is_active(&self) -> bool {
-        self.state.is_active()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if this worktree is inactive.
     pub fn is_inactive(&self) -> bool {
         matches!(self.state, WorktreeState::Inactive)
     }
 
     /// Get the worktree name as a string slice.

---- application::commands::delete_worktree::tests::test_execute_repository_not_configured stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_repository_not_configured' (2957949) panicked at crates/worktree/src/application/commands/delete_worktree.rs:277:9:
assertion failed: matches!(result, Ok(_))

---- application::commands::delete_worktree::tests::test_execute_with_git_failure stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_with_git_failure' (2957951) panicked at crates/worktree/src/application/commands/delete_worktree.rs:236:18:
Expected GitError

---- application::commands::delete_worktree::tests::test_execute_valid_deletion stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_valid_deletion' (2957950) panicked at crates/worktree/src/application/commands/delete_worktree.rs:152:9:
assertion failed: result.is_ok()

failures:
    application::commands::delete_worktree::tests::test_execute_repository_not_configured
    application::commands::delete_worktree::tests::test_execute_valid_deletion
    application::commands::delete_worktree::tests::test_execute_with_git_failure

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
