*** crates/worktree/src/domain/entities/worktree.rs:266:9: replace Worktree::is_inactive -> bool with false

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace Worktree::is_inactive -> bool with false
@@ -258,17 +258,17 @@
 
     /// Check if this worktree is active.
     pub fn is_active(&self) -> bool {
         self.state.is_active()
     }
 
     /// Check if this worktree is inactive.
     pub fn is_inactive(&self) -> bool {
-        matches!(self.state, WorktreeState::Inactive)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the worktree name as a string slice.
     pub fn name_str(&self) -> &str {
         self.name.as_str()
     }
 
     /// Get the path as a string slice.

---- domain::entities::worktree::tests::test_deactivate_worktree stdout ----

thread 'domain::entities::worktree::tests::test_deactivate_worktree' (2960101) panicked at crates/worktree/src/domain/entities/worktree.rs:503:9:
assertion failed: deactivated.is_inactive()

failures:
    domain::entities::worktree::tests::test_deactivate_worktree

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
