*** crates/worktree/src/domain/entities/worktree.rs:271:9: replace Worktree::name_str -> &str with "xyzzy"

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace Worktree::name_str -> &str with "xyzzy"
@@ -263,17 +263,17 @@
 
     /// Check if this worktree is inactive.
     pub fn is_inactive(&self) -> bool {
         matches!(self.state, WorktreeState::Inactive)
     }
 
     /// Get the worktree name as a string slice.
     pub fn name_str(&self) -> &str {
-        self.name.as_str()
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the path as a string slice.
     pub fn path_str(&self) -> &str {
         self.path.as_str()
     }
 
     /// Get the source branch as a string slice.

---- application::commands::create_worktree::tests::test_execute_duplicate_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_duplicate_name' (2960299) panicked at crates/worktree/src/application/commands/create_worktree.rs:210:20:
Expected WorktreeExists error, got RepositoryError("Worktree with name 'xyzzy' already exists")

---- application::queries::list_worktrees::tests::test_execute_combined_filters stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_combined_filters' (2960316) panicked at crates/worktree/src/application/queries/list_worktrees.rs:372:9:
assertion `left == right` failed
  left: 0
 right: 1

---- application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix' (2960318) panicked at crates/worktree/src/application/queries/list_worktrees.rs:293:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    application::commands::create_worktree::tests::test_execute_duplicate_name
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix
    application::queries::list_worktrees::tests::test_execute_filter_by_state
    application::queries::list_worktrees::tests::test_execute_filter_by_type
    application::queries::list_worktrees::tests::test_execute_list_all
    application::queries::list_worktrees::tests::test_execute_with_limit
    application::queries::list_worktrees::tests::test_execute_with_offset
    domain::entities::worktree::tests::test_new_worktree
    domain::repositories::worktree_repository::tests::test_duplicate_name
    domain::repositories::worktree_repository::tests::test_get_by_name
    domain::repositories::worktree_repository::tests::test_list_all

test result: FAILED. 95 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
