*** crates/worktree/src/domain/entities/worktree.rs:281:9: replace Worktree::source_branch_str -> &str with "xyzzy"

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace Worktree::source_branch_str -> &str with "xyzzy"
@@ -273,17 +273,17 @@
 
     /// Get the path as a string slice.
     pub fn path_str(&self) -> &str {
         self.path.as_str()
     }
 
     /// Get the source branch as a string slice.
     pub fn source_branch_str(&self) -> &str {
-        self.source_branch.as_str()
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl serde::Serialize for Worktree {
     fn serialize<S>(&self, serializer: S) -> Result<S::Ok, S::Error>
     where
         S: serde::Serializer,
     {

---- domain::entities::worktree::tests::test_new_worktree stdout ----

thread 'domain::entities::worktree::tests::test_new_worktree' (2962405) panicked at crates/worktree/src/domain/entities/worktree.rs:471:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "main"

failures:
    domain::entities::worktree::tests::test_new_worktree

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
