*** crates/worktree/src/domain/entities/worktree.rs:334:17: replace <impl serde::Deserialize<'de> for Worktree>::deserialize::<impl serde::de::Visitor<'de> for WorktreeVisitor>::expecting -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace <impl serde::Deserialize<'de> for Worktree>::deserialize::<impl serde::de::Visitor<'de> for WorktreeVisitor>::expecting -> std::fmt::Result with Ok(Default::default())
@@ -326,17 +326,17 @@
         }
 
         struct WorktreeVisitor;
 
         impl<'de> serde::de::Visitor<'de> for WorktreeVisitor {
             type Value = Worktree;
 
             fn expecting(&self, formatter: &mut std::fmt::Formatter) -> std::fmt::Result {
-                formatter.write_str("struct Worktree")
+                Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
             }
 
             fn visit_map<V>(self, mut map: V) -> Result<Worktree, V::Error>
             where
                 V: MapAccess<'de>,
             {
                 let mut id: Option<WorktreeId> = None;
                 let mut name: Option<WorktreeName> = None;

*** result: Success
