*** crates/worktree/src/domain/entities/worktree.rs:47:9: replace AbsolutePath::as_str -> &str with ""

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace AbsolutePath::as_str -> &str with ""
@@ -39,17 +39,17 @@
     /// Caller must ensure the path is absolute.
     #[allow(dead_code)]
     pub(crate) fn unsafe_new(s: String) -> Self {
         Self(s)
     }
 
     /// Get the inner string slice.
     pub fn as_str(&self) -> &str {
-        &self.0
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::fmt::Display for AbsolutePath {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         write!(f, "{}", self.0)
     }
 }

---- domain::entities::worktree::tests::test_new_worktree stdout ----

thread 'domain::entities::worktree::tests::test_new_worktree' (2946913) panicked at crates/worktree/src/domain/entities/worktree.rs:469:9:
assertion `left == right` failed
  left: ""
 right: "/tmp/test-worktree"

failures:
    domain::entities::worktree::tests::test_new_worktree

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
