*** crates/worktree/src/domain/entities/worktree_id.rs:33:9: replace WorktreeId::parse -> Result<Self, WorktreeIdParseError> with Ok(Default::default())

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_id.rs
+++ replace WorktreeId::parse -> Result<Self, WorktreeIdParseError> with Ok(Default::default())
@@ -25,19 +25,17 @@
         Self(Uuid::new_v4())
     }
 
     /// Parse a WorktreeId from a string.
     ///
     /// # Errors
     /// Returns `WorktreeIdParseError` if the string is not a valid UUID.
     pub fn parse(s: &str) -> Result<Self, WorktreeIdParseError> {
-        Uuid::parse_str(s)
-            .map(Self)
-            .map_err(|_| WorktreeIdParseError::InvalidUuid)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the inner UUID.
     pub fn as_uuid(&self) -> Uuid {
         self.0
     }
 
     /// Convert to a string representation.

---- domain::entities::worktree_id::tests::test_display stdout ----

thread 'domain::entities::worktree_id::tests::test_display' (2964319) panicked at crates/worktree/src/domain/entities/worktree_id.rs:125:9:
assertion `left == right` failed
  left: "00000000-0000-0000-0000-000000000000"
 right: "550e8400-e29b-41d4-a716-446655440000"

---- domain::entities::worktree_id::tests::test_as_uuid stdout ----

thread 'domain::entities::worktree_id::tests::test_as_uuid' (2964317) panicked at crates/worktree/src/domain/entities/worktree_id.rs:138:9:
assertion `left == right` failed
  left: "00000000-0000-0000-0000-000000000000"
 right: "550e8400-e29b-41d4-a716-446655440000"

---- domain::entities::worktree_id::tests::test_parse_valid_uuid stdout ----

thread 'domain::entities::worktree_id::tests::test_parse_valid_uuid' (2964322) panicked at crates/worktree/src/domain/entities/worktree_id.rs:113:9:
assertion `left == right` failed
  left: "00000000-0000-0000-0000-000000000000"
 right: "550e8400-e29b-41d4-a716-446655440000"

failures:
    domain::entities::worktree_id::tests::test_as_uuid
    domain::entities::worktree_id::tests::test_display
    domain::entities::worktree_id::tests::test_parse_invalid_uuid
    domain::entities::worktree_id::tests::test_parse_valid_uuid

test result: FAILED. 107 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
