*** crates/worktree/src/domain/entities/worktree_id.rs:40:9: replace WorktreeId::as_uuid -> Uuid with Default::default()

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_id.rs
+++ replace WorktreeId::as_uuid -> Uuid with Default::default()
@@ -32,17 +32,17 @@
     pub fn parse(s: &str) -> Result<Self, WorktreeIdParseError> {
         Uuid::parse_str(s)
             .map(Self)
             .map_err(|_| WorktreeIdParseError::InvalidUuid)
     }
 
     /// Get the inner UUID.
     pub fn as_uuid(&self) -> Uuid {
-        self.0
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Convert to a string representation.
     pub fn to_string(&self) -> String {
         self.0.to_string()
     }
 
     /// Check if this is the default/empty ID (for testing).

---- domain::entities::worktree_id::tests::test_as_uuid stdout ----

thread 'domain::entities::worktree_id::tests::test_as_uuid' (2964705) panicked at crates/worktree/src/domain/entities/worktree_id.rs:140:9:
assertion `left == right` failed
  left: "00000000-0000-0000-0000-000000000000"
 right: "550e8400-e29b-41d4-a716-446655440000"

failures:
    domain::entities::worktree_id::tests::test_as_uuid

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
