*** crates/worktree/src/domain/entities/worktree_id.rs:82:9: replace <impl serde::Deserialize<'de> for WorktreeId>::deserialize -> Result<Self, D::Error> with Ok(Default::default())

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_id.rs
+++ replace <impl serde::Deserialize<'de> for WorktreeId>::deserialize -> Result<Self, D::Error> with Ok(Default::default())
@@ -74,19 +74,17 @@
     }
 }
 
 impl<'de> serde::Deserialize<'de> for WorktreeId {
     fn deserialize<D>(deserializer: D) -> Result<Self, D::Error>
     where
         D: serde::Deserializer<'de>,
     {
-        Uuid::deserialize(deserializer)
-            .map(Self)
-            .map_err(serde::de::Error::custom)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Error types for WorktreeId parsing.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum WorktreeIdParseError {
     #[error("Invalid UUID format")]
     InvalidUuid,

---- domain::entities::worktree::tests::test_serialization stdout ----

thread 'domain::entities::worktree::tests::test_serialization' (2966458) panicked at crates/worktree/src/domain/entities/worktree.rs:575:72:
called `Result::unwrap()` on an `Err` value: Error("expected `,` or `}`", line: 1, column: 7)

---- domain::entities::worktree_id::tests::test_serialize_deserialize stdout ----

thread 'domain::entities::worktree_id::tests::test_serialize_deserialize' (2966468) panicked at crates/worktree/src/domain/entities/worktree_id.rs:145:74:
called `Result::unwrap()` on an `Err` value: Error("trailing characters", line: 1, column: 1)

failures:
    domain::entities::worktree::tests::test_serialization
    domain::entities::worktree_id::tests::test_serialize_deserialize

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
