*** crates/worktree/src/domain/entities/worktree_name.rs:36:20: replace > with == in WorktreeName::parse

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_name.rs
+++ replace > with == in WorktreeName::parse
@@ -28,17 +28,17 @@
     ///
     /// # Errors
     /// Returns `WorktreeNameParseError` if the name is invalid.
     pub fn parse(s: &str) -> Result<Self, WorktreeNameParseError> {
         // Validate length
         if s.len() < Self::MIN_LENGTH {
             return Err(WorktreeNameParseError::TooShort);
         }
-        if s.len() > Self::MAX_LENGTH {
+        if s.len() == /* ~ changed by cargo-mutants ~ */ Self::MAX_LENGTH {
             return Err(WorktreeNameParseError::TooLong);
         }
 
         // Cannot start or end with hyphen
         if s.starts_with('-') || s.ends_with('-') {
             return Err(WorktreeNameParseError::InvalidBoundary);
         }

---- domain::entities::worktree_name::tests::name_max_length stdout ----

thread 'domain::entities::worktree_name::tests::name_max_length' (2968577) panicked at crates/worktree/src/domain/entities/worktree_name.rs:174:9:
assertion failed: result.is_ok()

---- domain::entities::worktree_name::tests::name_too_long stdout ----

thread 'domain::entities::worktree_name::tests::name_too_long' (2968582) panicked at crates/worktree/src/domain/entities/worktree_name.rs:181:9:
assertion `left == right` failed
  left: Ok(WorktreeName("aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"))
 right: Err(TooLong)

failures:
    domain::entities::worktree_name::tests::name_max_length
    domain::entities::worktree_name::tests::name_too_long

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
