*** crates/worktree/src/domain/entities/worktree_name.rs:41:31: replace || with && in WorktreeName::parse

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_name.rs
+++ replace || with && in WorktreeName::parse
@@ -33,17 +33,17 @@
         if s.len() < Self::MIN_LENGTH {
             return Err(WorktreeNameParseError::TooShort);
         }
         if s.len() > Self::MAX_LENGTH {
             return Err(WorktreeNameParseError::TooLong);
         }
 
         // Cannot start or end with hyphen
-        if s.starts_with('-') || s.ends_with('-') {
+        if s.starts_with('-') && /* ~ changed by cargo-mutants ~ */ s.ends_with('-') {
             return Err(WorktreeNameParseError::InvalidBoundary);
         }
 
         // Only allow lowercase alphanumeric and hyphens
         if !s
             .chars()
             .all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')
         {

---- application::commands::create_worktree::tests::test_execute_invalid_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_invalid_name' (2970826) panicked at crates/worktree/src/application/commands/create_worktree.rs:225:9:
assertion failed: result.is_err()

---- domain::entities::worktree_name::tests::name_ends_with_hyphen stdout ----

thread 'domain::entities::worktree_name::tests::name_ends_with_hyphen' (2970870) panicked at crates/worktree/src/domain/entities/worktree_name.rs:149:9:
assertion `left == right` failed
  left: Ok(WorktreeName("feature-"))
 right: Err(InvalidBoundary)

---- domain::entities::worktree_name::tests::name_starts_with_hyphen stdout ----

thread 'domain::entities::worktree_name::tests::name_starts_with_hyphen' (2970873) panicked at crates/worktree/src/domain/entities/worktree_name.rs:143:9:
assertion `left == right` failed
  left: Ok(WorktreeName("-feature"))
 right: Err(InvalidBoundary)

failures:
    application::commands::create_worktree::tests::test_execute_invalid_name
    domain::entities::worktree_name::tests::name_ends_with_hyphen
    domain::entities::worktree_name::tests::name_starts_with_hyphen

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
