*** crates/worktree/src/domain/entities/worktree_name.rs:46:12: delete ! in WorktreeName::parse

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_name.rs
+++ delete ! in WorktreeName::parse
@@ -38,17 +38,17 @@
         }
 
         // Cannot start or end with hyphen
         if s.starts_with('-') || s.ends_with('-') {
             return Err(WorktreeNameParseError::InvalidBoundary);
         }
 
         // Only allow lowercase alphanumeric and hyphens
-        if !s
+        if  /* ~ changed by cargo-mutants ~ */s
             .chars()
             .all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')
         {
             return Err(WorktreeNameParseError::InvalidCharacters);
         }
 
         // Cannot have consecutive hyphens
         if s.contains("--") {

---- application::commands::create_worktree::tests::test_execute_git_failure stdout ----

thread 'application::commands::create_worktree::tests::test_execute_git_failure' (2971451) panicked at crates/worktree/src/application/commands/create_worktree.rs:291:9:
assertion failed: matches!(result, Err(CreateWorktreeError::GitError(msg)) if
    msg.contains("git worktree add failed"))

---- application::commands::create_worktree::tests::test_execute_duplicate_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_duplicate_name' (2971450) panicked at crates/worktree/src/application/commands/create_worktree.rs:178:38:
called `Result::unwrap()` on an `Err` value: InvalidName(InvalidCharacters)

---- application::commands::create_worktree::tests::test_execute_relative_path stdout ----

thread 'application::commands::create_worktree::tests::test_execute_relative_path' (2971453) panicked at crates/worktree/src/application/commands/create_worktree.rs:241:9:
assertion failed: matches!(result, Err(CreateWorktreeError::PathNotAbsolute { .. }))

failures:
    application::commands::create_worktree::tests::test_execute_duplicate_name
    application::commands::create_worktree::tests::test_execute_git_failure
    application::commands::create_worktree::tests::test_execute_relative_path
    application::commands::create_worktree::tests::test_execute_repository_not_configured
    application::commands::create_worktree::tests::test_execute_with_git_adapter
    application::commands::delete_worktree::tests::test_execute_active_worktree
    application::commands::delete_worktree::tests::test_execute_active_worktree_force
    application::commands::delete_worktree::tests::test_execute_repository_not_configured
    application::commands::delete_worktree::tests::test_execute_valid_deletion
    application::commands::delete_worktree::tests::test_execute_with_git_failure
    application::commands::delete_worktree::tests::test_execute_with_g

test result: FAILED. 63 passed; 48 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
