*** crates/worktree/src/domain/entities/worktree_state.rs:53:9: replace WorktreeState::deactivate -> Option<Self> with None

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_state.rs
+++ replace WorktreeState::deactivate -> Option<Self> with None
@@ -45,21 +45,17 @@
             Some(Self::Active)
         }
     }
 
     /// Transition to Inactive state.
     ///
     /// Returns None if already inactive.
     pub fn deactivate(self) -> Option<Self> {
-        if matches!(self, Self::Inactive) {
-            None
-        } else {
-            Some(Self::Inactive)
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the string representation.
     pub fn as_str(&self) -> &'static str {
         match self {
             Self::Created => "created",
             Self::Active => "active",
             Self::Inactive => "inactive",

---- domain::entities::worktree::tests::test_deactivate_already_inactive stdout ----

thread 'domain::entities::worktree::tests::test_deactivate_already_inactive' (2982046) panicked at crates/worktree/src/domain/entities/worktree.rs:509:62:
called `Option::unwrap()` on a `None` value

---- domain::entities::worktree::tests::test_deactivate_worktree stdout ----

thread 'domain::entities::worktree::tests::test_deactivate_worktree' (2982047) panicked at crates/worktree/src/domain/entities/worktree.rs:500:9:
assertion failed: deactivated.is_some()

---- domain::entities::worktree_state::tests::test_deactivate_active stdout ----

thread 'domain::entities::worktree_state::tests::test_deactivate_active' (2982078) panicked at crates/worktree/src/domain/entities/worktree_state.rs:160:9:
assertion `left == right` failed
  left: None
 right: Some(Inactive)

failures:
    domain::entities::worktree::tests::test_deactivate_already_inactive
    domain::entities::worktree::tests::test_deactivate_worktree
    domain::entities::worktree_state::tests::test_deactivate_active
    domain::entities::worktree_state::tests::test_deactivate_created

test result: FAILED. 107 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
