*** crates/worktree/src/domain/entities/worktree_state.rs:62:9: replace WorktreeState::as_str -> &'static str with ""

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_state.rs
+++ replace WorktreeState::as_str -> &'static str with ""
@@ -54,21 +54,17 @@
             None
         } else {
             Some(Self::Inactive)
         }
     }
 
     /// Get the string representation.
     pub fn as_str(&self) -> &'static str {
-        match self {
-            Self::Created => "created",
-            Self::Active => "active",
-            Self::Inactive => "inactive",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for WorktreeState {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{}", self.as_str())
     }
 }

---- domain::entities::worktree::tests::test_serialization stdout ----

thread 'domain::entities::worktree::tests::test_serialization' (2982517) panicked at crates/worktree/src/domain/entities/worktree.rs:575:72:
called `Result::unwrap()` on an `Err` value: Error("unknown variant ``, expected one of `created`, `active`, `inactive`", line: 1, column: 128)

---- domain::entities::worktree_state::tests::test_display stdout ----

thread 'domain::entities::worktree_state::tests::test_display' (2982551) panicked at crates/worktree/src/domain/entities/worktree_state.rs:177:9:
assertion `left == right` failed
  left: ""
 right: "created"

---- domain::entities::worktree_state::tests::test_serialize stdout ----

thread 'domain::entities::worktree_state::tests::test_serialize' (2982554) panicked at crates/worktree/src/domain/entities/worktree_state.rs:184:9:
assertion `left == right` failed
  left: "\"\""
 right: "\"created\""

failures:
    domain::entities::worktree::tests::test_serialization
    domain::entities::worktree_state::tests::test_display
    domain::entities::worktree_state::tests::test_serialize

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
