*** crates/worktree/src/domain/entities/worktree_state.rs:92:13: delete match arm "created" in <impl serde::Deserialize<'de> for WorktreeState>::deserialize

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_state.rs
+++ delete match arm "created" in <impl serde::Deserialize<'de> for WorktreeState>::deserialize
@@ -84,17 +84,17 @@
 
 impl<'de> serde::Deserialize<'de> for WorktreeState {
     fn deserialize<D>(deserializer: D) -> Result<Self, D::Error>
     where
         D: serde::Deserializer<'de>,
     {
         let s = String::deserialize(deserializer)?;
         match s.as_str() {
-            "created" => Ok(Self::Created),
+             /* ~ changed by cargo-mutants ~ */
             "active" => Ok(Self::Active),
             "inactive" => Ok(Self::Inactive),
             _ => Err(serde::de::Error::unknown_variant(
                 &s,
                 &["created", "active", "inactive"],
             )),
         }
     }

---- domain::entities::worktree::tests::test_serialization stdout ----

thread 'domain::entities::worktree::tests::test_serialization' (2984752) panicked at crates/worktree/src/domain/entities/worktree.rs:575:72:
called `Result::unwrap()` on an `Err` value: Error("unknown variant `created`, expected one of `created`, `active`, `inactive`", line: 1, column: 135)

---- domain::entities::worktree_state::tests::test_deserialize_valid stdout ----

thread 'domain::entities::worktree_state::tests::test_deserialize_valid' (2984785) panicked at crates/worktree/src/domain/entities/worktree_state.rs:204:74:
called `Result::unwrap()` on an `Err` value: Error("unknown variant `created`, expected one of `created`, `active`, `inactive`", line: 0, column: 0)

failures:
    domain::entities::worktree::tests::test_serialization
    domain::entities::worktree_state::tests::test_deserialize_valid

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
