*** crates/worktree/src/domain/entities/worktree_type.rs:116:9: replace WorktreeTypeEnum::as_str -> &'static str with "xyzzy"

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_type.rs
+++ replace WorktreeTypeEnum::as_str -> &'static str with "xyzzy"
@@ -108,20 +108,17 @@
             "dev" => Ok(Self::Dev),
             "agent" => Ok(Self::Agent),
             other => Err(WorktreeTypeParseError::new(other.to_string())),
         }
     }
 
     /// Get the string representation.
     pub fn as_str(&self) -> &'static str {
-        match self {
-            Self::Dev => "dev",
-            Self::Agent => "agent",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for WorktreeTypeEnum {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{}", self.as_str())
     }
 }

---- domain::entities::worktree::tests::test_serialization stdout ----

thread 'domain::entities::worktree::tests::test_serialization' (2991612) panicked at crates/worktree/src/domain/entities/worktree.rs:575:72:
called `Result::unwrap()` on an `Err` value: Error("Invalid worktree type: xyzzy. Must be 'dev' or 'agent'", line: 1, column: 91)

---- domain::entities::worktree_type::tests::test_display stdout ----

thread 'domain::entities::worktree_type::tests::test_display' (2991661) panicked at crates/worktree/src/domain/entities/worktree_type.rs:204:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "dev"

---- domain::entities::worktree_type::tests::test_serialize stdout ----

thread 'domain::entities::worktree_type::tests::test_serialize' (2991663) panicked at crates/worktree/src/domain/entities/worktree_type.rs:210:9:
assertion `left == right` failed
  left: "\"xyzzy\""
 right: "\"dev\""

failures:
    domain::entities::worktree::tests::test_serialization
    domain::entities::worktree_type::tests::test_display
    domain::entities::worktree_type::tests::test_serialize

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
