*** crates/worktree/src/domain/entities/worktree_type.rs:68:9: replace <impl WorktreeType for Agent>::type_name -> &'static str with ""

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_type.rs
+++ replace <impl WorktreeType for Agent>::type_name -> &'static str with ""
@@ -60,17 +60,17 @@
 }
 
 /// Implementation for Agent worktrees.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Hash)]
 pub struct Agent;
 
 impl WorktreeType for Agent {
     fn type_name() -> &'static str {
-        "agent"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn from_str(s: &str) -> Result<Self, WorktreeTypeParseError> {
         if s.eq_ignore_ascii_case("agent") {
             Ok(Self)
         } else {
             Err(WorktreeTypeParseError::InvalidType(s.to_string()))
         }

---- domain::entities::worktree_type::tests::test_agent_type_name stdout ----

thread 'domain::entities::worktree_type::tests::test_agent_type_name' (2988698) panicked at crates/worktree/src/domain/entities/worktree_type.rs:159:9:
assertion `left == right` failed
  left: ""
 right: "agent"

---- domain::entities::worktree_type::tests::test_to_string stdout ----

thread 'domain::entities::worktree_type::tests::test_to_string' (2988711) panicked at crates/worktree/src/domain/entities/worktree_type.rs:262:9:
assertion `left == right` failed
  left: ""
 right: "agent"

failures:
    domain::entities::worktree_type::tests::test_agent_type_name
    domain::entities::worktree_type::tests::test_to_string

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
