*** crates/worktree/src/domain/entities/worktree_type.rs:80:9: replace <impl WorktreeType for Agent>::to_string -> String with "xyzzy".into()

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_type.rs
+++ replace <impl WorktreeType for Agent>::to_string -> String with "xyzzy".into()
@@ -72,17 +72,17 @@
         if s.eq_ignore_ascii_case("agent") {
             Ok(Self)
         } else {
             Err(WorktreeTypeParseError::InvalidType(s.to_string()))
         }
     }
 
     fn to_string(&self) -> String {
-        Self::type_name().to_string()
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Error types for WorktreeType parsing.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum WorktreeTypeParseError {
     #[error("Invalid worktree type: {0}. Must be 'dev' or 'agent'")]
     InvalidType(String),

---- domain::entities::worktree_type::tests::test_to_string stdout ----

thread 'domain::entities::worktree_type::tests::test_to_string' (2990406) panicked at crates/worktree/src/domain/entities/worktree_type.rs:262:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "agent"

failures:
    domain::entities::worktree_type::tests::test_to_string

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
