*** crates/worktree/src/domain/repositories/worktree_repository.rs:101:16: delete ! in ListFilter::matches

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ delete ! in ListFilter::matches
@@ -93,17 +93,17 @@
 
         if let Some(state) = self.state {
             if worktree.state != state {
                 return false;
             }
         }
 
         if let Some(ref prefix) = self.name_prefix {
-            if !worktree.name_str().starts_with(prefix) {
+            if  /* ~ changed by cargo-mutants ~ */worktree.name_str().starts_with(prefix) {
                 return false;
             }
         }
 
         true
     }
 }

---- application::queries::list_worktrees::tests::test_execute_combined_filters stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_combined_filters' (2998571) panicked at crates/worktree/src/application/queries/list_worktrees.rs:372:9:
assertion `left == right` failed
  left: 0
 right: 1

---- application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix' (2998573) panicked at crates/worktree/src/application/queries/list_worktrees.rs:293:9:
assertion `left == right` failed
  left: 1
 right: 2

---- domain::repositories::worktree_repository::tests::test_list_name_prefix stdout ----

thread 'domain::repositories::worktree_repository::tests::test_list_name_prefix' (2998648) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:594:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix
    domain::repositories::worktree_repository::tests::test_list_name_prefix

test result: FAILED. 108 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
