*** crates/worktree/src/domain/repositories/worktree_repository.rs:217:13: delete match arm (WorktreeRepositoryError::DuplicateName{name:a}, WorktreeRepositoryError::DuplicateName{name:b},) in <impl PartialEq for WorktreeRepositoryError>::eq

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ delete match arm (WorktreeRepositoryError::DuplicateName{name:a}, WorktreeRepositoryError::DuplicateName{name:b},) in <impl PartialEq for WorktreeRepositoryError>::eq
@@ -209,20 +209,17 @@
             }
         }
     }
 }
 
 impl PartialEq for WorktreeRepositoryError {
     fn eq(&self, other: &Self) -> bool {
         match (self, other) {
-            (
-                WorktreeRepositoryError::DuplicateName { name: a },
-                WorktreeRepositoryError::DuplicateName { name: b },
-            ) => a == b,
+             /* ~ changed by cargo-mutants ~ */
             (
                 WorktreeRepositoryError::NotFound { id: a },
                 WorktreeRepositoryError::NotFound { id: b },
             ) => a == b,
             (
                 WorktreeRepositoryError::DatabaseError(a),
                 WorktreeRepositoryError::DatabaseError(b),
             ) => a == b,

*** result: Success
