*** crates/worktree/src/domain/repositories/worktree_repository.rs:221:13: delete match arm (WorktreeRepositoryError::NotFound{id:a}, WorktreeRepositoryError::NotFound{id:b},) in <impl PartialEq for WorktreeRepositoryError>::eq

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ delete match arm (WorktreeRepositoryError::NotFound{id:a}, WorktreeRepositoryError::NotFound{id:b},) in <impl PartialEq for WorktreeRepositoryError>::eq
@@ -213,20 +213,17 @@
 
 impl PartialEq for WorktreeRepositoryError {
     fn eq(&self, other: &Self) -> bool {
         match (self, other) {
             (
                 WorktreeRepositoryError::DuplicateName { name: a },
                 WorktreeRepositoryError::DuplicateName { name: b },
             ) => a == b,
-            (
-                WorktreeRepositoryError::NotFound { id: a },
-                WorktreeRepositoryError::NotFound { id: b },
-            ) => a == b,
+             /* ~ changed by cargo-mutants ~ */
             (
                 WorktreeRepositoryError::DatabaseError(a),
                 WorktreeRepositoryError::DatabaseError(b),
             ) => a == b,
             (
                 WorktreeRepositoryError::RepositoryError(a),
                 WorktreeRepositoryError::RepositoryError(b),
             ) => a == b,

*** result: Success
