*** crates/worktree/src/domain/repositories/worktree_repository.rs:224:20: replace == with != in <impl PartialEq for WorktreeRepositoryError>::eq

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace == with != in <impl PartialEq for WorktreeRepositoryError>::eq
@@ -216,17 +216,17 @@
         match (self, other) {
             (
                 WorktreeRepositoryError::DuplicateName { name: a },
                 WorktreeRepositoryError::DuplicateName { name: b },
             ) => a == b,
             (
                 WorktreeRepositoryError::NotFound { id: a },
                 WorktreeRepositoryError::NotFound { id: b },
-            ) => a == b,
+            ) => a != /* ~ changed by cargo-mutants ~ */ b,
             (
                 WorktreeRepositoryError::DatabaseError(a),
                 WorktreeRepositoryError::DatabaseError(b),
             ) => a == b,
             (
                 WorktreeRepositoryError::RepositoryError(a),
                 WorktreeRepositoryError::RepositoryError(b),
             ) => a == b,

*** result: Success
