*** crates/worktree/src/domain/repositories/worktree_repository.rs:225:13: delete match arm (WorktreeRepositoryError::DatabaseError(a), WorktreeRepositoryError::DatabaseError(b),) in <impl PartialEq for WorktreeRepositoryError>::eq

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ delete match arm (WorktreeRepositoryError::DatabaseError(a), WorktreeRepositoryError::DatabaseError(b),) in <impl PartialEq for WorktreeRepositoryError>::eq
@@ -217,20 +217,17 @@
             (
                 WorktreeRepositoryError::DuplicateName { name: a },
                 WorktreeRepositoryError::DuplicateName { name: b },
             ) => a == b,
             (
                 WorktreeRepositoryError::NotFound { id: a },
                 WorktreeRepositoryError::NotFound { id: b },
             ) => a == b,
-            (
-                WorktreeRepositoryError::DatabaseError(a),
-                WorktreeRepositoryError::DatabaseError(b),
-            ) => a == b,
+             /* ~ changed by cargo-mutants ~ */
             (
                 WorktreeRepositoryError::RepositoryError(a),
                 WorktreeRepositoryError::RepositoryError(b),
             ) => a == b,
             _ => false,
         }
     }
 }

*** result: Success
