*** crates/worktree/src/domain/repositories/worktree_repository.rs:304:9: replace <impl WorktreeRepository for InMemoryWorktreeRepository>::add -> Result<WorktreeId, WorktreeRepositoryError> with Ok(Default::default())

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace <impl WorktreeRepository for InMemoryWorktreeRepository>::add -> Result<WorktreeId, WorktreeRepositoryError> with Ok(Default::default())
@@ -296,37 +296,17 @@
             .map(|lock| lock.values().cloned().collect())
             .unwrap_or_else(|| Vec::new())
     }
 }
 
 impl WorktreeRepository for InMemoryWorktreeRepository {
     fn add(&self, worktree: &Worktree) -> Result<WorktreeId, WorktreeRepositoryError> {
         // Check for duplicate name
-        let name = worktree.name_str().to_string();
-        let worktrees = self
-            .worktrees
-            .read()
-            .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-
-        if worktrees.values().any(|w| w.name_str() == name) {
-            return Err(WorktreeRepositoryError::duplicate_name(&name));
-        }
-
-        drop(worktrees);
-
-        let mut worktrees = self
-            .worktrees
-            .write()
-            .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-
-        let id = worktree.id.clone();
-        worktrees.insert(id.clone(), worktree.clone());
-
-        Ok(id)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn get_by_id(&self, id: &WorktreeId) -> Result<Option<Worktree>, WorktreeRepositoryError> {
         let worktrees = self
             .worktrees
             .read()
             .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
         Ok(worktrees.get(id).cloned())

---- application::commands::create_worktree::tests::test_execute_duplicate_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_duplicate_name' (3005833) panicked at crates/worktree/src/application/commands/create_worktree.rs:205:9:
assertion failed: result.is_err()

---- application::commands::delete_worktree::tests::test_execute_active_worktree_force stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree_force' (3005840) panicked at crates/worktree/src/application/commands/delete_worktree.rs:209:9:
assertion failed: matches!(result, Ok(_))

---- application::commands::delete_worktree::tests::test_execute_valid_deletion stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_valid_deletion' (3005843) panicked at crates/worktree/src/application/commands/delete_worktree.rs:152:9:
assertion failed: result.is_ok()

failures:
    application::commands::create_worktree::tests::test_execute_duplicate_name
    application::commands::delete_worktree::tests::test_execute_active_worktree
    application::commands::delete_worktree::tests::test_execute_active_worktree_force
    application::commands::delete_worktree::tests::test_execute_repository_not_configured
    application::commands::delete_worktree::tests::test_execute_valid_deletion
    application::commands::delete_worktree::tests::test_execute_with_git_failure
    application::commands::delete_worktree::tests::test_execute_with_git_failure_force
    application::queries::get_worktree::tests::test_execute_found
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix
    application::queries::list_worktrees::tests::test_execute_filter_by_state

test result: FAILED. 85 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
