*** crates/worktree/src/domain/repositories/worktree_repository.rs:346:36: replace == with != in <impl WorktreeRepository for InMemoryWorktreeRepository>::get_by_name

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace == with != in <impl WorktreeRepository for InMemoryWorktreeRepository>::get_by_name
@@ -338,17 +338,17 @@
     ) -> Result<Option<Worktree>, WorktreeRepositoryError> {
         let worktrees = self
             .worktrees
             .read()
             .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
 
         Ok(worktrees
             .values()
-            .find(|w| w.name_str() == name.as_str())
+            .find(|w| w.name_str() != /* ~ changed by cargo-mutants ~ */ name.as_str())
             .cloned())
     }
 
     fn list(&self, filter: ListFilter) -> Result<Vec<Worktree>, WorktreeRepositoryError> {
         let worktrees = self
             .worktrees
             .read()
             .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;

---- application::commands::create_worktree::tests::test_execute_duplicate_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_duplicate_name' (3008259) panicked at crates/worktree/src/application/commands/create_worktree.rs:210:20:
Expected WorktreeExists error, got RepositoryError("Worktree with name 'test-worktree' already exists")

---- domain::repositories::worktree_repository::tests::test_get_by_name stdout ----

thread 'domain::repositories::worktree_repository::tests::test_get_by_name' (3008350) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:440:9:
assertion failed: retrieved.is_some()

failures:
    application::commands::create_worktree::tests::test_execute_duplicate_name
    domain::repositories::worktree_repository::tests::test_get_by_name

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
