*** crates/worktree/src/domain/repositories/worktree_repository.rs:365:12: delete ! in <impl WorktreeRepository for InMemoryWorktreeRepository>::delete

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ delete ! in <impl WorktreeRepository for InMemoryWorktreeRepository>::delete
@@ -357,17 +357,17 @@
     }
 
     fn delete(&self, id: &WorktreeId) -> Result<(), WorktreeRepositoryError> {
         let mut worktrees = self
             .worktrees
             .write()
             .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
 
-        if !worktrees.contains_key(id) {
+        if  /* ~ changed by cargo-mutants ~ */worktrees.contains_key(id) {
             return Err(WorktreeRepositoryError::not_found(id.to_string().as_str()));
         }
 
         worktrees.remove(id);
         Ok(())
     }
 
     fn update_state(

---- application::commands::delete_worktree::tests::test_execute_active_worktree_force stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree_force' (3009809) panicked at crates/worktree/src/application/commands/delete_worktree.rs:209:9:
assertion failed: matches!(result, Ok(_))

---- application::commands::delete_worktree::tests::test_execute_valid_deletion stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_valid_deletion' (3009814) panicked at crates/worktree/src/application/commands/delete_worktree.rs:152:9:
assertion failed: result.is_ok()

---- application::commands::delete_worktree::tests::test_execute_repository_not_configured stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_repository_not_configured' (3009813) panicked at crates/worktree/src/application/commands/delete_worktree.rs:277:9:
assertion failed: matches!(result, Ok(_))

failures:
    application::commands::delete_worktree::tests::test_execute_active_worktree_force
    application::commands::delete_worktree::tests::test_execute_repository_not_configured
    application::commands::delete_worktree::tests::test_execute_valid_deletion
    application::commands::delete_worktree::tests::test_execute_with_git_failure_force
    domain::repositories::worktree_repository::tests::test_delete
    domain::repositories::worktree_repository::tests::test_delete_nonexistent

test result: FAILED. 105 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
