*** crates/worktree/src/domain/repositories/worktree_repository.rs:378:9: replace <impl WorktreeRepository for InMemoryWorktreeRepository>::update_state -> Result<(), WorktreeRepositoryError> with Ok(())

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace <impl WorktreeRepository for InMemoryWorktreeRepository>::update_state -> Result<(), WorktreeRepositoryError> with Ok(())
@@ -370,27 +370,17 @@
         Ok(())
     }
 
     fn update_state(
         &self,
         id: &WorktreeId,
         state: WorktreeState,
     ) -> Result<(), WorktreeRepositoryError> {
-        let mut worktrees = self
-            .worktrees
-            .write()
-            .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-
-        let worktree = worktrees
-            .get_mut(id)
-            .ok_or_else(|| WorktreeRepositoryError::not_found(id.to_string().as_str()))?;
-
-        worktree.state = state;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::{AbsolutePath, BranchName};
     use chrono::Utc;

---- domain::repositories::worktree_repository::tests::test_update_state stdout ----

thread 'domain::repositories::worktree_repository::tests::test_update_state' (3010324) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:493:9:
assertion `left == right` failed
  left: Created
 right: Active

failures:
    domain::repositories::worktree_repository::tests::test_update_state

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
