*** crates/worktree/src/domain/repositories/worktree_repository.rs:50:9: replace ListFilter::with_state -> Self with Default::default()

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace ListFilter::with_state -> Self with Default::default()
@@ -42,18 +42,17 @@
     /// Set the worktree type filter.
     pub fn with_worktree_type(mut self, worktree_type: WorktreeTypeEnum) -> Self {
         self.worktree_type = Some(worktree_type);
         self
     }
 
     /// Set the state filter.
     pub fn with_state(mut self, state: WorktreeState) -> Self {
-        self.state = Some(state);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the name prefix filter.
     pub fn with_name_prefix(mut self, prefix: &str) -> Self {
         self.name_prefix = Some(prefix.to_string());
         self
     }

---- application::queries::list_worktrees::tests::test_execute_filter_by_state stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_state' (2994026) panicked at crates/worktree/src/application/queries/list_worktrees.rs:265:9:
assertion `left == right` failed
  left: 3
 right: 1

---- domain::repositories::worktree_repository::tests::test_list_with_filter stdout ----

thread 'domain::repositories::worktree_repository::tests::test_list_with_filter' (2994183) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:467:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    application::queries::list_worktrees::tests::test_execute_filter_by_state
    domain::repositories::worktree_repository::tests::test_list_with_filter

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
