*** crates/worktree/src/domain/repositories/worktree_repository.rs:68:9: replace ListFilter::with_offset -> Self with Default::default()

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace ListFilter::with_offset -> Self with Default::default()
@@ -60,18 +60,17 @@
     /// Set the limit.
     pub fn with_limit(mut self, limit: usize) -> Self {
         self.limit = Some(limit);
         self
     }
 
     /// Set the offset.
     pub fn with_offset(mut self, offset: usize) -> Self {
-        self.offset = Some(offset);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Apply the filter to a collection of worktrees.
     pub fn apply<'b, 'a, I>(&'b self, worktrees: I) -> impl Iterator<Item = &'a Worktree> + 'b
     where
         I: Iterator<Item = &'a Worktree> + 'b,
     {
         let limit = self.limit.unwrap_or(usize::MAX);

---- application::queries::list_worktrees::tests::test_execute_with_offset stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_with_offset' (2994538) panicked at crates/worktree/src/application/queries/list_worktrees.rs:335:9:
assertion `left == right` failed
  left: 10
 right: 5

---- domain::repositories::worktree_repository::tests::test_list_offset stdout ----

thread 'domain::repositories::worktree_repository::tests::test_list_offset' (2994608) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:566:9:
assertion `left == right` failed
  left: ["test-0", "test-3", "test-7"]
 right: ["test-8", "test-1", "test-6"]

failures:
    application::queries::list_worktrees::tests::test_execute_with_offset
    domain::repositories::worktree_repository::tests::test_list_offset

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
