*** crates/worktree/src/domain/repositories/worktree_repository.rs:88:9: replace ListFilter::matches -> bool with false

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace ListFilter::matches -> bool with false
@@ -80,35 +80,17 @@
         worktrees
             .filter(move |w| self.matches(w))
             .skip(offset)
             .take(limit)
     }
 
     /// Check if a worktree matches this filter.
     fn matches(&self, worktree: &Worktree) -> bool {
-        if let Some(ref worktree_type) = self.worktree_type {
-            if worktree.worktree_type != *worktree_type {
-                return false;
-            }
-        }
-
-        if let Some(state) = self.state {
-            if worktree.state != state {
-                return false;
-            }
-        }
-
-        if let Some(ref prefix) = self.name_prefix {
-            if !worktree.name_str().starts_with(prefix) {
-                return false;
-            }
-        }
-
-        true
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Repository trait for Worktree persistence.
 ///
 /// This trait defines the interface for persisting and retrieving worktrees.
 /// Implementations can use any persistence mechanism (SQL, NoSQL, in-memory, etc.).
 pub trait WorktreeRepository: Send + Sync + std::fmt::Debug {

---- application::queries::list_worktrees::tests::test_execute_filter_by_state stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_state' (2996527) panicked at crates/worktree/src/application/queries/list_worktrees.rs:265:9:
assertion `left == right` failed
  left: 0
 right: 1

---- application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix' (2996524) panicked at crates/worktree/src/application/queries/list_worktrees.rs:293:9:
assertion `left == right` failed
  left: 0
 right: 2

---- application::queries::list_worktrees::tests::test_execute_filter_by_type stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_type' (2996529) panicked at crates/worktree/src/application/queries/list_worktrees.rs:234:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix
    application::queries::list_worktrees::tests::test_execute_filter_by_state
    application::queries::list_worktrees::tests::test_execute_filter_by_type
    application::queries::list_worktrees::tests::test_execute_list_all
    application::queries::list_worktrees::tests::test_execute_with_limit
    application::queries::list_worktrees::tests::test_execute_with_offset
    domain::repositories::worktree_repository::tests::test_list_all
    domain::repositories::worktree_repository::tests::test_list_limit
    domain::repositories::worktree_repository::tests::test_list_name_prefix
    domain::repositories::worktree_repository::tests::test_list_offset
    domain::repositories::worktree_repository::tests::test_list_with_

test result: FAILED. 99 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
