*** crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:155:9: replace <impl WorktreeRepository for SqlxWorktreeRepository>::get_by_name -> Result<Option<Worktree>, WorktreeRepositoryError> with Ok(None)

*** mutation diff:
--- crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs
+++ replace <impl WorktreeRepository for SqlxWorktreeRepository>::get_by_name -> Result<Option<Worktree>, WorktreeRepositoryError> with Ok(None)
@@ -147,38 +147,17 @@
             })
         })
     }
 
     fn get_by_name(
         &self,
         name: &WorktreeName,
     ) -> Result<Option<Worktree>, WorktreeRepositoryError> {
-        let pool = self.pool.clone();
-        let name_str = name.to_string();
-
-        tokio::task::block_in_place(|| {
-            tokio::runtime::Handle::current().block_on(async move {
-                let sql = r#"
-                    SELECT id, name, worktree_type, path, state, source_branch, description, created_at
-                    FROM worktrees WHERE name = ?
-                "#;
-
-               let result = sqlx::query_as::<_, WorktreeRow>(sql)
-                     .bind(name_str)
-                     .fetch_optional(pool.as_ref())
-                     .await
-                     .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-
-                 match result {
-                     Some(row) => row.to_worktree().map(Some),
-                     None => Ok(None),
-                 }
-            })
-        })
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     fn list(&self, filter: ListFilter) -> Result<Vec<Worktree>, WorktreeRepositoryError> {
         let pool = self.pool.clone();
 
         tokio::task::block_in_place(|| {
             tokio::runtime::Handle::current().block_on(async move {
                 let results = build_list_query(&filter, pool).await?;

*** result: Success
