*** crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:301:5: replace build_list_query -> Result<Vec<WorktreeRow>, WorktreeRepositoryError> with Ok(vec![])

*** mutation diff:
--- crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs
+++ replace build_list_query -> Result<Vec<WorktreeRow>, WorktreeRepositoryError> with Ok(vec![])
@@ -293,44 +293,17 @@
     }
 }
 
 /// Build a SQL query for listing worktrees with filters.
 async fn build_list_query(
     filter: &ListFilter,
     pool: Arc<Pool<Sqlite>>,
 ) -> Result<Vec<WorktreeRow>, WorktreeRepositoryError> {
-    let mut query = sqlx::query_as::<_, WorktreeRow>(
-        "SELECT id, name, worktree_type, path, state, source_branch, description, created_at FROM worktrees WHERE 1=1",
-    );
-
-    if let Some(ref worktree_type) = filter.worktree_type {
-        query = query.bind(worktree_type.to_string());
-    }
-
-    if let Some(state) = filter.state {
-        query = query.bind(state.to_string());
-    }
-
-    if let Some(ref name_prefix) = filter.name_prefix {
-        query = query.bind(format!("{}%", name_prefix));
-    }
-
-    if let Some(limit) = filter.limit {
-        query = query.bind(limit as i64);
-    }
-
-    if let Some(offset) = filter.offset {
-        query = query.bind(offset as i64);
-    }
-
-    query
-        .fetch_all(pool.as_ref())
-        .await
-        .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse a state string into WorktreeState.
 fn parse_state(s: &str) -> Result<WorktreeState, WorktreeRepositoryError> {
     match s.to_lowercase().as_str() {
         "created" => Ok(WorktreeState::Created),
         "active" => Ok(WorktreeState::Active),
         "inactive" => Ok(WorktreeState::Inactive),

*** result: Success
