*** crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:110:9: replace <impl GitAdapter for GitWorktreeAdapter>::remove_worktree -> Result<(), GitAdapterError> with Ok(())

*** mutation diff:
--- crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs
+++ replace <impl GitAdapter for GitWorktreeAdapter>::remove_worktree -> Result<(), GitAdapterError> with Ok(())
@@ -102,18 +102,17 @@
         // Execute: git worktree add <path> <branch>
         self.execute_git(&["worktree", "add", path, source_branch])?;
 
         Ok(path.to_string())
     }
 
     fn remove_worktree(&self, path: &str) -> Result<(), GitAdapterError> {
         // Execute: git worktree remove <path>
-        self.execute_git(&["worktree", "remove", path])?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Adapter that uses git2 library instead of git commands.
 pub struct Git2WorktreeAdapter {
     repo: std::sync::Arc<Repository>,
 }

---- infrastructure::vcs::git_worktree_adapter::tests::test_remove_worktree stdout ----

thread 'infrastructure::vcs::git_worktree_adapter::tests::test_remove_worktree' (3024350) panicked at crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:362:9:
assertion failed: result.is_err()

failures:
    infrastructure::vcs::git_worktree_adapter::tests::test_remove_worktree

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
