*** crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:217:9: replace <impl GitAdapter for Git2WorktreeAdapter>::remove_worktree -> Result<(), GitAdapterError> with Ok(())

*** mutation diff:
--- crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs
+++ replace <impl GitAdapter for Git2WorktreeAdapter>::remove_worktree -> Result<(), GitAdapterError> with Ok(())
@@ -209,39 +209,17 @@
                 stderr.trim()
             )));
         }
 
         Ok(path.to_string())
     }
 
     fn remove_worktree(&self, path: &str) -> Result<(), GitAdapterError> {
-        let repo_path = self
-            .repo
-            .path()
-            .to_str()
-            .ok_or_else(|| GitAdapterError::GitError("Invalid repository path".to_string()))?;
-
-        let output = Command::new("git")
-            .args(["worktree", "remove", path])
-            .current_dir(repo_path)
-            .output()
-            .map_err(|e| {
-                GitAdapterError::CommandFailed(format!("Failed to execute git command: {}", e))
-            })?;
-
-        if !output.status.success() {
-            let stderr = String::from_utf8_lossy(&output.stderr);
-            return Err(GitAdapterError::CommandFailed(format!(
-                "Git command failed: {}",
-                stderr.trim()
-            )));
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Builder for creating Git adapters.
 #[derive(Debug, Default)]
 pub struct GitAdapterBuilder {
     repo_path: Option<String>,
     use_git2: bool,

*** result: Success
