*** crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:253:9: replace GitAdapterBuilder::repo_path -> Self with Default::default()

*** mutation diff:
--- crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs
+++ replace GitAdapterBuilder::repo_path -> Self with Default::default()
@@ -245,18 +245,17 @@
 pub struct GitAdapterBuilder {
     repo_path: Option<String>,
     use_git2: bool,
 }
 
 impl GitAdapterBuilder {
     /// Set the repository path.
     pub fn repo_path(mut self, path: &str) -> Self {
-        self.repo_path = Some(path.to_string());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Use git2 library instead of git commands.
     pub fn use_git2(mut self) -> Self {
         self.use_git2 = true;
         self
     }

---- infrastructure::vcs::git_worktree_adapter::tests::test_adapter_builder stdout ----

thread 'infrastructure::vcs::git_worktree_adapter::tests::test_adapter_builder' (3028861) panicked at crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:385:9:
assertion failed: result.is_ok()

failures:
    infrastructure::vcs::git_worktree_adapter::tests::test_adapter_builder

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
