*** crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:65:9: replace GitWorktreeAdapter::execute_git -> Result<String, GitAdapterError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs
+++ replace GitWorktreeAdapter::execute_git -> Result<String, GitAdapterError> with Ok("xyzzy".into())
@@ -57,33 +57,17 @@
 
     /// Get the repository path.
     pub fn repo_path(&self) -> &str {
         &self.repo_path
     }
 
     /// Execute a Git command and return the result.
     fn execute_git(&self, args: &[&str]) -> Result<String, GitAdapterError> {
-        let output = Command::new("git")
-            .args(args)
-            .current_dir(&self.repo_path)
-            .output()
-            .map_err(|e| {
-                GitAdapterError::CommandFailed(format!("Failed to execute git command: {}", e))
-            })?;
-
-        if !output.status.success() {
-            let stderr = String::from_utf8_lossy(&output.stderr);
-            return Err(GitAdapterError::CommandFailed(format!(
-                "Git command failed: {}",
-                stderr.trim()
-            )));
-        }
-
-        Ok(String::from_utf8_lossy(&output.stdout).to_string())
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl GitAdapter for GitWorktreeAdapter {
     fn add_worktree(&self, path: &str, source_branch: &str) -> Result<String, GitAdapterError> {
         // Validate path is absolute
         if !path.starts_with('/') {
             return Err(GitAdapterError::PathExists {

---- infrastructure::vcs::git_worktree_adapter::tests::test_remove_worktree stdout ----

thread 'infrastructure::vcs::git_worktree_adapter::tests::test_remove_worktree' (3020927) panicked at crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:347:9:
assertion failed: result.is_err()

---- infrastructure::vcs::git_worktree_adapter::tests::test_execute_git_command stdout ----

thread 'infrastructure::vcs::git_worktree_adapter::tests::test_execute_git_command' (3020923) panicked at crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:297:9:
assertion failed: result.unwrap().contains("git")

failures:
    infrastructure::vcs::git_worktree_adapter::tests::test_execute_git_command
    infrastructure::vcs::git_worktree_adapter::tests::test_remove_worktree

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
