*** crates/worktree/src/application/commands/create_worktree.rs:33:9: replace <impl GitAdapter for MockGitAdapter>::add_worktree -> Result<String, GitAdapterError> with Ok(String::new())

*** mutation diff:
--- crates/worktree/src/application/commands/create_worktree.rs
+++ replace <impl GitAdapter for MockGitAdapter>::add_worktree -> Result<String, GitAdapterError> with Ok(String::new())
@@ -25,17 +25,17 @@
             add_worktree_result: Ok("/tmp/test".to_string()),
             remove_worktree_result: Ok(()),
         }
     }
 }
 
 impl GitAdapter for MockGitAdapter {
     fn add_worktree(&self, _path: &str, _source_branch: &str) -> Result<String, GitAdapterError> {
-        self.add_worktree_result.clone()
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn remove_worktree(&self, _path: &str) -> Result<(), GitAdapterError> {
         self.remove_worktree_result.clone()
     }
 }
 
 /// Command to create a new worktree.

---- application::commands::create_worktree::tests::test_execute_git_failure stdout ----

thread 'application::commands::create_worktree::tests::test_execute_git_failure' (2902027) panicked at crates/worktree/src/application/commands/create_worktree.rs:290:9:
assertion failed: result.is_err()

failures:
    application::commands::create_worktree::tests::test_execute_git_failure

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
