*** crates/worktree/src/application/queries/list_worktrees.rs:144:9: replace ListWorktreesQuery::for_testing -> Self with Default::default()

*** mutation diff:
--- crates/worktree/src/application/queries/list_worktrees.rs
+++ replace ListWorktreesQuery::for_testing -> Self with Default::default()
@@ -136,24 +136,17 @@
     /// Create a query with in-memory repository (for testing).
     pub fn for_testing(
         worktree_type: Option<WorktreeTypeEnum>,
         state: Option<crate::domain::entities::WorktreeState>,
         name_prefix: Option<String>,
         limit: Option<usize>,
         offset: Option<usize>,
     ) -> Self {
-        Self {
-            worktree_type,
-            state,
-            name_prefix,
-            limit,
-            offset,
-            repository: Box::new(InMemoryWorktreeRepository::new()),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::{
         AbsolutePath, BranchName, Worktree, WorktreeId, WorktreeName, WorktreeState,

---- application::queries::list_worktrees::tests::test_execute_empty_result stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_empty_result' (2943931) panicked at crates/worktree/src/application/queries/list_worktrees.rs:383:9:
assertion `left == right` failed
  left: 1
 right: 0

---- application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix' (2943932) panicked at crates/worktree/src/application/queries/list_worktrees.rs:286:9:
assertion `left == right` failed
  left: 3
 right: 2

---- application::queries::list_worktrees::tests::test_execute_filter_by_state stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_state' (2943933) panicked at crates/worktree/src/application/queries/list_worktrees.rs:258:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    application::queries::list_worktrees::tests::test_execute_empty_result
    application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix
    application::queries::list_worktrees::tests::test_execute_filter_by_state
    application::queries::list_worktrees::tests::test_execute_filter_by_type
    application::queries::list_worktrees::tests::test_execute_with_limit
    application::queries::list_worktrees::tests::test_execute_with_offset

test result: FAILED. 105 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
