*** crates/worktree/src/domain/entities/worktree.rs:106:9: replace BranchName::as_str -> &str with "xyzzy"

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace BranchName::as_str -> &str with "xyzzy"
@@ -98,17 +98,17 @@
     /// Create a BranchName without validation.
     #[allow(dead_code)]
     pub(crate) fn unsafe_new(s: String) -> Self {
         Self(s)
     }
 
     /// Get the inner string slice.
     pub fn as_str(&self) -> &str {
-        &self.0
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the length of the branch name.
     pub fn len(&self) -> usize {
         self.0.len()
     }
 
     /// Check if empty.

---- domain::entities::worktree::tests::test_new_worktree stdout ----

thread 'domain::entities::worktree::tests::test_new_worktree' (2949261) panicked at crates/worktree/src/domain/entities/worktree.rs:471:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "main"

failures:
    domain::entities::worktree::tests::test_new_worktree

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
