*** crates/worktree/src/domain/entities/worktree.rs:254:13: delete field description from struct Self expression in Worktree::with_description

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ delete field description from struct Self expression in Worktree::with_description
@@ -246,17 +246,17 @@
     /// Returns a new Worktree with the updated state.
     pub fn with_state(self, state: WorktreeState) -> Self {
         Self { state, ..self }
     }
 
     /// Update the description.
     pub fn with_description(self, description: Option<String>) -> Self {
         Self {
-            description,
+             /* ~ changed by cargo-mutants ~ */
             ..self
         }
     }
 
     /// Check if this worktree is active.
     pub fn is_active(&self) -> bool {
         self.state.is_active()
     }

---- domain::entities::worktree::tests::test_update_description stdout ----

thread 'domain::entities::worktree::tests::test_update_description' (2957861) panicked at crates/worktree/src/domain/entities/worktree.rs:521:9:
assertion `left == right` failed
  left: Some("Test worktree")
 right: Some("Updated")

failures:
    domain::entities::worktree::tests::test_update_description

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
