*** crates/worktree/src/domain/entities/worktree.rs:261:9: replace Worktree::is_active -> bool with false

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree.rs
+++ replace Worktree::is_active -> bool with false
@@ -253,17 +253,17 @@
         Self {
             description,
             ..self
         }
     }
 
     /// Check if this worktree is active.
     pub fn is_active(&self) -> bool {
-        self.state.is_active()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if this worktree is inactive.
     pub fn is_inactive(&self) -> bool {
         matches!(self.state, WorktreeState::Inactive)
     }
 
     /// Get the worktree name as a string slice.

---- application::commands::delete_worktree::tests::test_execute_active_worktree stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree' (2958165) panicked at crates/worktree/src/application/commands/delete_worktree.rs:186:9:
assertion failed: result.is_err()

---- domain::entities::worktree::tests::test_activate_worktree stdout ----

thread 'domain::entities::worktree::tests::test_activate_worktree' (2958187) panicked at crates/worktree/src/domain/entities/worktree.rs:483:9:
assertion failed: activated.is_active()

failures:
    application::commands::delete_worktree::tests::test_execute_active_worktree
    domain::entities::worktree::tests::test_activate_worktree

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
