*** crates/worktree/src/domain/entities/worktree_name.rs:48:67: replace || with && in WorktreeName::parse

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_name.rs
+++ replace || with && in WorktreeName::parse
@@ -40,17 +40,17 @@
         // Cannot start or end with hyphen
         if s.starts_with('-') || s.ends_with('-') {
             return Err(WorktreeNameParseError::InvalidBoundary);
         }
 
         // Only allow lowercase alphanumeric and hyphens
         if !s
             .chars()
-            .all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')
+            .all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() && /* ~ changed by cargo-mutants ~ */ c == '-')
         {
             return Err(WorktreeNameParseError::InvalidCharacters);
         }
 
         // Cannot have consecutive hyphens
         if s.contains("--") {
             return Err(WorktreeNameParseError::ConsecutiveHyphens);
         }

---- application::commands::create_worktree::tests::test_execute_git_failure stdout ----

thread 'application::commands::create_worktree::tests::test_execute_git_failure' (2972335) panicked at crates/worktree/src/application/commands/create_worktree.rs:291:9:
assertion failed: matches!(result, Err(CreateWorktreeError::GitError(msg)) if
    msg.contains("git worktree add failed"))

---- application::commands::create_worktree::tests::test_execute_duplicate_name stdout ----

thread 'application::commands::create_worktree::tests::test_execute_duplicate_name' (2972334) panicked at crates/worktree/src/application/commands/create_worktree.rs:178:38:
called `Result::unwrap()` on an `Err` value: InvalidName(InvalidCharacters)

---- application::commands::create_worktree::tests::test_execute_with_git_adapter stdout ----

thread 'application::commands::create_worktree::tests::test_execute_with_git_adapter' (2972339) panicked at crates/worktree/src/application/commands/create_worktree.rs:266:9:
assertion failed: result.is_ok()

failures:
    application::commands::create_worktree::tests::test_execute_duplicate_name
    application::commands::create_worktree::tests::test_execute_git_failure
    application::commands::create_worktree::tests::test_execute_with_git_adapter
    application::commands::delete_worktree::tests::test_execute_active_worktree
    application::commands::delete_worktree::tests::test_execute_active_worktree_force
    application::commands::delete_worktree::tests::test_execute_repository_not_configured
    application::commands::delete_worktree::tests::test_execute_valid_deletion
    application::commands::delete_worktree::tests::test_execute_with_git_failure
    application::commands::delete_worktree::tests::test_execute_with_git_failure_force
    application::commands::delete_worktree::tests::test_force_mode_deletes_active
    application::queries::get_worktree::tests::test_execute_found

test result: FAILED. 70 passed; 41 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
