*** crates/worktree/src/domain/entities/worktree_state.rs:30:9: replace WorktreeState::is_active -> bool with false

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_state.rs
+++ replace WorktreeState::is_active -> bool with false
@@ -22,17 +22,17 @@
     Created,
     Active,
     Inactive,
 }
 
 impl WorktreeState {
     /// Check if the worktree is currently active.
     pub fn is_active(&self) -> bool {
-        matches!(self, Self::Active)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if the worktree has been created (either active or just created).
     pub fn is_created(&self) -> bool {
         matches!(self, Self::Created | Self::Active)
     }
 
     /// Transition to Active state.

---- application::commands::delete_worktree::tests::test_execute_active_worktree stdout ----

thread 'application::commands::delete_worktree::tests::test_execute_active_worktree' (2979848) panicked at crates/worktree/src/application/commands/delete_worktree.rs:186:9:
assertion failed: result.is_err()

---- domain::entities::worktree::tests::test_activate_already_active stdout ----

thread 'domain::entities::worktree::tests::test_activate_already_active' (2979869) panicked at crates/worktree/src/domain/entities/worktree.rs:492:9:
assertion failed: result.is_none()

---- domain::entities::worktree::tests::test_activate_worktree stdout ----

thread 'domain::entities::worktree::tests::test_activate_worktree' (2979870) panicked at crates/worktree/src/domain/entities/worktree.rs:483:9:
assertion failed: activated.is_active()

failures:
    application::commands::delete_worktree::tests::test_execute_active_worktree
    domain::entities::worktree::tests::test_activate_already_active
    domain::entities::worktree::tests::test_activate_worktree
    domain::entities::worktree_state::tests::test_activate_active_returns_none
    domain::entities::worktree_state::tests::test_active_is_active

test result: FAILED. 106 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
