*** crates/worktree/src/domain/entities/worktree_type.rs:125:9: replace <impl fmt::Display for WorktreeTypeEnum>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_type.rs
+++ replace <impl fmt::Display for WorktreeTypeEnum>::fmt -> fmt::Result with Ok(Default::default())
@@ -117,17 +117,17 @@
             Self::Dev => "dev",
             Self::Agent => "agent",
         }
     }
 }
 
 impl fmt::Display for WorktreeTypeEnum {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        write!(f, "{}", self.as_str())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl serde::Serialize for WorktreeTypeEnum {
     fn serialize<S>(&self, serializer: S) -> Result<S::Ok, S::Error>
     where
         S: serde::Serializer,
     {

---- domain::entities::worktree_type::tests::test_display stdout ----

thread 'domain::entities::worktree_type::tests::test_display' (2992206) panicked at crates/worktree/src/domain/entities/worktree_type.rs:207:9:
assertion `left == right` failed
  left: ""
 right: "dev"

failures:
    domain::entities::worktree_type::tests::test_display

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
