*** crates/worktree/src/domain/entities/worktree_type.rs:46:9: replace <impl WorktreeType for Dev>::type_name -> &'static str with "xyzzy"

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_type.rs
+++ replace <impl WorktreeType for Dev>::type_name -> &'static str with "xyzzy"
@@ -38,17 +38,17 @@
 }
 
 /// Implementation for Developer worktrees.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Hash)]
 pub struct Dev;
 
 impl WorktreeType for Dev {
     fn type_name() -> &'static str {
-        "dev"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn from_str(s: &str) -> Result<Self, WorktreeTypeParseError> {
         if s.eq_ignore_ascii_case("dev") {
             Ok(Self)
         } else {
             Err(WorktreeTypeParseError::InvalidType(s.to_string()))
         }

---- domain::entities::worktree_type::tests::test_dev_type_name stdout ----

thread 'domain::entities::worktree_type::tests::test_dev_type_name' (2986961) panicked at crates/worktree/src/domain/entities/worktree_type.rs:154:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "dev"

---- domain::entities::worktree_type::tests::test_to_string stdout ----

thread 'domain::entities::worktree_type::tests::test_to_string' (2986965) panicked at crates/worktree/src/domain/entities/worktree_type.rs:261:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "dev"

failures:
    domain::entities::worktree_type::tests::test_dev_type_name
    domain::entities::worktree_type::tests::test_to_string

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
