*** crates/worktree/src/domain/entities/worktree_type.rs:58:9: replace <impl WorktreeType for Dev>::to_string -> String with String::new()

*** mutation diff:
--- crates/worktree/src/domain/entities/worktree_type.rs
+++ replace <impl WorktreeType for Dev>::to_string -> String with String::new()
@@ -50,17 +50,17 @@
         if s.eq_ignore_ascii_case("dev") {
             Ok(Self)
         } else {
             Err(WorktreeTypeParseError::InvalidType(s.to_string()))
         }
     }
 
     fn to_string(&self) -> String {
-        Self::type_name().to_string()
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Implementation for Agent worktrees.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Hash)]
 pub struct Agent;
 
 impl WorktreeType for Agent {

---- domain::entities::worktree_type::tests::test_to_string stdout ----

thread 'domain::entities::worktree_type::tests::test_to_string' (2987595) panicked at crates/worktree/src/domain/entities/worktree_type.rs:261:9:
assertion `left == right` failed
  left: ""
 right: "dev"

failures:
    domain::entities::worktree_type::tests::test_to_string

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
