*** crates/worktree/src/domain/repositories/worktree_repository.rs:310:52: replace == with != in <impl WorktreeRepository for InMemoryWorktreeRepository>::add

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace == with != in <impl WorktreeRepository for InMemoryWorktreeRepository>::add
@@ -302,17 +302,17 @@
     fn add(&self, worktree: &Worktree) -> Result<WorktreeId, WorktreeRepositoryError> {
         // Check for duplicate name
         let name = worktree.name_str().to_string();
         let worktrees = self
             .worktrees
             .read()
             .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
 
-        if worktrees.values().any(|w| w.name_str() == name) {
+        if worktrees.values().any(|w| w.name_str() != /* ~ changed by cargo-mutants ~ */ name) {
             return Err(WorktreeRepositoryError::duplicate_name(&name));
         }
 
         drop(worktrees);
 
         let mut worktrees = self
             .worktrees
             .write()

---- application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix' (3006466) panicked at crates/worktree/src/application/queries/list_worktrees.rs:293:9:
assertion `left == right` failed
  left: 1
 right: 2

---- application::queries::list_worktrees::tests::test_execute_list_all stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_list_all' (3006469) panicked at crates/worktree/src/application/queries/list_worktrees.rs:206:9:
assertion `left == right` failed
  left: 1
 right: 3

---- application::queries::list_worktrees::tests::test_execute_filter_by_state stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_state' (3006467) panicked at crates/worktree/src/application/queries/list_worktrees.rs:265:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix
    application::queries::list_worktrees::tests::test_execute_filter_by_state
    application::queries::list_worktrees::tests::test_execute_filter_by_type
    application::queries::list_worktrees::tests::test_execute_list_all
    application::queries::list_worktrees::tests::test_execute_with_limit
    application::queries::list_worktrees::tests::test_execute_with_offset
    domain::repositories::worktree_repository::tests::test_duplicate_name
    domain::repositories::worktree_repository::tests::test_list_all
    domain::repositories::worktree_repository::tests::test_list_limit
    domain::repositories::worktree_repository::tests::test_list_name_prefix
    domain::repositories::worktree_repository::tests::test_list_offset
    domain::repositories::worktree_repository::tests::test_list_with_filte

test result: FAILED. 99 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
