*** crates/worktree/src/domain/repositories/worktree_repository.rs:351:9: replace <impl WorktreeRepository for InMemoryWorktreeRepository>::list -> Result<Vec<Worktree>, WorktreeRepositoryError> with Ok(vec![])

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace <impl WorktreeRepository for InMemoryWorktreeRepository>::list -> Result<Vec<Worktree>, WorktreeRepositoryError> with Ok(vec![])
@@ -343,22 +343,17 @@
 
         Ok(worktrees
             .values()
             .find(|w| w.name_str() == name.as_str())
             .cloned())
     }
 
     fn list(&self, filter: ListFilter) -> Result<Vec<Worktree>, WorktreeRepositoryError> {
-        let worktrees = self
-            .worktrees
-            .read()
-            .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;
-
-        Ok(filter.apply(worktrees.values()).cloned().collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn delete(&self, id: &WorktreeId) -> Result<(), WorktreeRepositoryError> {
         let mut worktrees = self
             .worktrees
             .write()
             .map_err(|e| WorktreeRepositoryError::DatabaseError(e.to_string()))?;

---- application::queries::list_worktrees::tests::test_execute_combined_filters stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_combined_filters' (3009253) panicked at crates/worktree/src/application/queries/list_worktrees.rs:372:9:
assertion `left == right` failed
  left: 0
 right: 1

---- application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix' (3009255) panicked at crates/worktree/src/application/queries/list_worktrees.rs:293:9:
assertion `left == right` failed
  left: 0
 right: 2

---- application::queries::list_worktrees::tests::test_execute_filter_by_state stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_state' (3009256) panicked at crates/worktree/src/application/queries/list_worktrees.rs:265:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix
    application::queries::list_worktrees::tests::test_execute_filter_by_state
    application::queries::list_worktrees::tests::test_execute_filter_by_type
    application::queries::list_worktrees::tests::test_execute_list_all
    application::queries::list_worktrees::tests::test_execute_with_limit
    application::queries::list_worktrees::tests::test_execute_with_offset
    domain::repositories::worktree_repository::tests::test_list_all
    domain::repositories::worktree_repository::tests::test_list_limit
    domain::repositories::worktree_repository::tests::test_list_name_prefix
    domain::repositories::worktree_repository::tests::test_list_offset
    domain::repositories::worktree_repository::tests::test_list_with_

test result: FAILED. 99 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
