*** crates/worktree/src/domain/repositories/worktree_repository.rs:44:9: replace ListFilter::with_worktree_type -> Self with Default::default()

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace ListFilter::with_worktree_type -> Self with Default::default()
@@ -36,18 +36,17 @@
 impl ListFilter {
     /// Create a new empty filter.
     pub fn new() -> Self {
         Self::default()
     }
 
     /// Set the worktree type filter.
     pub fn with_worktree_type(mut self, worktree_type: WorktreeTypeEnum) -> Self {
-        self.worktree_type = Some(worktree_type);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the state filter.
     pub fn with_state(mut self, state: WorktreeState) -> Self {
         self.state = Some(state);
         self
     }

---- application::queries::list_worktrees::tests::test_execute_empty_result stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_empty_result' (2993087) panicked at crates/worktree/src/application/queries/list_worktrees.rs:390:9:
assertion `left == right` failed
  left: 1
 right: 0

---- application::queries::list_worktrees::tests::test_execute_filter_by_type stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_type' (2993090) panicked at crates/worktree/src/application/queries/list_worktrees.rs:234:9:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    application::queries::list_worktrees::tests::test_execute_empty_result
    application::queries::list_worktrees::tests::test_execute_filter_by_type

test result: FAILED. 109 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
