*** crates/worktree/src/domain/repositories/worktree_repository.rs:62:9: replace ListFilter::with_limit -> Self with Default::default()

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace ListFilter::with_limit -> Self with Default::default()
@@ -54,18 +54,17 @@
     /// Set the name prefix filter.
     pub fn with_name_prefix(mut self, prefix: &str) -> Self {
         self.name_prefix = Some(prefix.to_string());
         self
     }
 
     /// Set the limit.
     pub fn with_limit(mut self, limit: usize) -> Self {
-        self.limit = Some(limit);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the offset.
     pub fn with_offset(mut self, offset: usize) -> Self {
         self.offset = Some(offset);
         self
     }

---- application::queries::list_worktrees::tests::test_execute_combined_filters stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_combined_filters' (2994412) panicked at crates/worktree/src/application/queries/list_worktrees.rs:372:9:
assertion `left == right` failed
  left: 3
 right: 1

---- application::queries::list_worktrees::tests::test_execute_with_limit stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_with_limit' (2994419) panicked at crates/worktree/src/application/queries/list_worktrees.rs:315:9:
assertion `left == right` failed
  left: 10
 right: 5

---- domain::repositories::worktree_repository::tests::test_list_limit stdout ----

thread 'domain::repositories::worktree_repository::tests::test_list_limit' (2994488) panicked at crates/worktree/src/domain/repositories/worktree_repository.rs:538:9:
assertion `left == right` failed
  left: 10
 right: 5

failures:
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_with_limit
    domain::repositories::worktree_repository::tests::test_list_limit
    domain::repositories::worktree_repository::tests::test_list_offset

test result: FAILED. 107 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
