*** crates/worktree/src/domain/repositories/worktree_repository.rs:88:9: replace ListFilter::matches -> bool with true

*** mutation diff:
--- crates/worktree/src/domain/repositories/worktree_repository.rs
+++ replace ListFilter::matches -> bool with true
@@ -80,35 +80,17 @@
         worktrees
             .filter(move |w| self.matches(w))
             .skip(offset)
             .take(limit)
     }
 
     /// Check if a worktree matches this filter.
     fn matches(&self, worktree: &Worktree) -> bool {
-        if let Some(ref worktree_type) = self.worktree_type {
-            if worktree.worktree_type != *worktree_type {
-                return false;
-            }
-        }
-
-        if let Some(state) = self.state {
-            if worktree.state != state {
-                return false;
-            }
-        }
-
-        if let Some(ref prefix) = self.name_prefix {
-            if !worktree.name_str().starts_with(prefix) {
-                return false;
-            }
-        }
-
-        true
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Repository trait for Worktree persistence.
 ///
 /// This trait defines the interface for persisting and retrieving worktrees.
 /// Implementations can use any persistence mechanism (SQL, NoSQL, in-memory, etc.).
 pub trait WorktreeRepository: Send + Sync + std::fmt::Debug {

---- application::queries::list_worktrees::tests::test_execute_empty_result stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_empty_result' (2996371) panicked at crates/worktree/src/application/queries/list_worktrees.rs:390:9:
assertion `left == right` failed
  left: 1
 right: 0

---- application::queries::list_worktrees::tests::test_execute_combined_filters stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_combined_filters' (2996370) panicked at crates/worktree/src/application/queries/list_worktrees.rs:373:9:
assertion `left == right` failed
  left: "agent-1"
 right: "feature-1"

---- application::queries::list_worktrees::tests::test_execute_filter_by_state stdout ----

thread 'application::queries::list_worktrees::tests::test_execute_filter_by_state' (2996373) panicked at crates/worktree/src/application/queries/list_worktrees.rs:265:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    application::queries::list_worktrees::tests::test_execute_combined_filters
    application::queries::list_worktrees::tests::test_execute_empty_result
    application::queries::list_worktrees::tests::test_execute_filter_by_name_prefix
    application::queries::list_worktrees::tests::test_execute_filter_by_state
    application::queries::list_worktrees::tests::test_execute_filter_by_type
    domain::repositories::worktree_repository::tests::test_list_name_prefix
    domain::repositories::worktree_repository::tests::test_list_with_filter

test result: FAILED. 104 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
