*** crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs:51:9: replace SqlxWorktreeRepository::run_migrations with ()

*** mutation diff:
--- crates/worktree/src/infrastructure/persistence/worktree_repository_sqlx.rs
+++ replace SqlxWorktreeRepository::run_migrations with ()
@@ -43,45 +43,17 @@
         Self {
             pool: Arc::new(pool),
         }
     }
 
     /// Run database migrations.
     async fn run_migrations(pool: &Pool<Sqlite>) {
         // Create worktrees table
-        sqlx::query(
-            r#"
-            CREATE TABLE IF NOT EXISTS worktrees (
-                id TEXT PRIMARY KEY NOT NULL,
-                name TEXT NOT NULL UNIQUE,
-                worktree_type TEXT NOT NULL,
-                path TEXT NOT NULL,
-                state TEXT NOT NULL DEFAULT 'created',
-                source_branch TEXT NOT NULL,
-                description TEXT,
-                created_at TEXT NOT NULL
-            )
-            "#,
-        )
-        .execute(pool)
-        .await
-        .expect("Failed to create worktrees table");
-
-        // Create index for faster lookups
-        sqlx::query(
-            r#"
-            CREATE INDEX IF NOT EXISTS idx_worktrees_name ON worktrees(name);
-            CREATE INDEX IF NOT EXISTS idx_worktrees_type ON worktrees(worktree_type);
-            CREATE INDEX IF NOT EXISTS idx_worktrees_state ON worktrees(state);
-            "#,
-        )
-        .execute(pool)
-        .await
-        .expect("Failed to create indexes");
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the inner pool for direct queries.
     pub fn pool(&self) -> &Pool<Sqlite> {
         &self.pool
     }
 }

*** result: Success
