*** crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:259:9: replace GitAdapterBuilder::use_git2 -> Self with Default::default()

*** mutation diff:
--- crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs
+++ replace GitAdapterBuilder::use_git2 -> Self with Default::default()
@@ -251,18 +251,17 @@
     /// Set the repository path.
     pub fn repo_path(mut self, path: &str) -> Self {
         self.repo_path = Some(path.to_string());
         self
     }
 
     /// Use git2 library instead of git commands.
     pub fn use_git2(mut self) -> Self {
-        self.use_git2 = true;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Build the adapter.
     pub fn build(self) -> Result<Box<dyn GitAdapter>, GitAdapterError> {
         let repo_path = self.repo_path.ok_or_else(|| {
             GitAdapterError::CommandFailed("Repository path not specified".to_string())
         })?;

*** result: Success
