*** crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:88:12: delete ! in <impl GitAdapter for GitWorktreeAdapter>::add_worktree

*** mutation diff:
--- crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs
+++ delete ! in <impl GitAdapter for GitWorktreeAdapter>::add_worktree
@@ -80,17 +80,17 @@
 
         Ok(String::from_utf8_lossy(&output.stdout).to_string())
     }
 }
 
 impl GitAdapter for GitWorktreeAdapter {
     fn add_worktree(&self, path: &str, source_branch: &str) -> Result<String, GitAdapterError> {
         // Validate path is absolute
-        if !path.starts_with('/') {
+        if  /* ~ changed by cargo-mutants ~ */path.starts_with('/') {
             return Err(GitAdapterError::PathExists {
                 path: path.to_string(),
             });
         }
 
         // Check if path already exists
         let path_obj = Path::new(path);
         if path_obj.exists() {

---- infrastructure::vcs::git_worktree_adapter::tests::test_add_worktree_relative_path stdout ----

thread 'infrastructure::vcs::git_worktree_adapter::tests::test_add_worktree_relative_path' (3022871) panicked at crates/worktree/src/infrastructure/vcs/git_worktree_adapter.rs:328:18:
Expected PathExists error

failures:
    infrastructure::vcs::git_worktree_adapter::tests::test_add_worktree_relative_path

test result: FAILED. 110 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
